{
  "version": 4,
  "type": "autosave",
  "timestamp": "2025-12-24T03:26:11.654Z",
  "items": [
    {
      "uuid": "8e225d84-0078-4bdd-aa95-8af2ed826817",
      "title": "LEGO Minions Unstoppable Bike Chase 75549 - Brand New Sealed",
      "price": 40,
      "cost": 15,
      "description": "Give your Minions fan an action-packed build with the LEGO Minions Unstoppable Bike Chase (75549). This set allows kids to build Gru’s iconic motorcycle and recreate favorite scenes from the Minions: The Rise of Gru movie.\n\nProduct Details:\n\nSet Number: 75549.\n\nPiece Count: 136 pieces.\n\nMinifigures: Includes 3 figures: Gru, plus Bob and Stuart Minion figures.\n\nFeatures: Build a detailed toy motorcycle for Gru and the Minions to ride on.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Minions, The Rise of Gru, Unstoppable Bike Chase, Gru, Bob, Stuart, Kids Toys, Building Set, LEGO 75549, Gift Idea, Toy Motorcycle, Despicable Me\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Minions, The Rise of Gru, Unstoppable Bike Chase, Gru, Bob, Stuart, Kids Toys, Building Set, LEGO 75549, Gift Idea, Toy Motorcycle, Despicable Me",
      "location": "",
      "notes": "qty 2 - $15ea",
      "status": "Active",
      "id": 953,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO 40700 Winter Holiday Train Seasonal GWP BNIB SET #1",
      "price": 25,
      "cost": 0,
      "description": "LEGO 40700 Winter Holiday Train (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set, available during the 2024 holiday period.\n\nThe model features a steam locomotive with two detachable carriages.\n\nThe carriages carry wrapped presents and a Christmas tree that can spin around.\n\nThe set contains 294 pieces.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty :3 sold 1, Qty:2\nRETAIL $25\nKat - ?\nChristine?\nCarrie - \nMegan - sold\nSabrina?",
      "status": "Sold",
      "listings_backup": [],
      "uuid": "d6d52d59-c9fd-403d-a0d4-0377cf2af0f7",
      "id": 954,
      "soldPrice": 25,
      "photos": []
    },
    {
      "guid": "01561a75-2511-4d78-a6d2-339dbe515487",
      "title": "Records",
      "price": 0,
      "cost": 0,
      "description": "",
      "brand": "",
      "size": "",
      "category": "Music",
      "condition": "fair",
      "tags": "",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 888,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/702096356069930",
          "date": "2025-12-17T18:23:50.525Z",
          "id": 72
        }
      ],
      "uuid": "b30cd6c1-4bd2-4855-8b02-d0909e54857f",
      "id": 955,
      "photos": []
    },
    {
      "guid": "1383b6f6-07b6-4801-aa50-c5884997dad0",
      "title": "Escents ZEN Ultrasonic Diffuser & Humidifier - Like New",
      "price": 20,
      "cost": 0,
      "description": "Escents Zen Ultrasonic Diffuser Enhance your home environment with this multi-functional Zen diffuser from Escents. It’s perfect for creating a relaxing atmosphere or adding much-needed moisture to the air during dry months.\n\nKey Features:\n\n4-in-1 Functionality: Works as a Mist Diffuser, Lamp, Night Light, and Humidifier.\n\nUltrasonic Technology: Diffuses aroma without using heat, preserving the quality of your essential oils.\n\nAir Quality: Functions as a mini air purifier (removes fine particles) and ionizer.\n\nDesign: Sleek, modern look that fits any decor.\n\nCondition: Used only a couple times still. Looks unused at all.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nPlease verify all details and specs prior to purchase",
      "brand": "",
      "size": "",
      "category": "Home",
      "condition": "like_new",
      "tags": "Escents, ZEN, Ultrasonic, Diffuser,",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [],
      "uuid": "e30e7086-97ed-47c0-86c8-edbae84d832b",
      "id": 956,
      "photos": []
    },
    {
      "uuid": "11664dbf-695e-49bc-ae3a-586938fb21ef",
      "title": "Rare Elon Musk Boring Company \"Not-A-Fire-Extinguisher\"",
      "price": 500,
      "cost": 40,
      "description": "Up for sale is an authentic, brand new The Boring Company Fire Extinguisher. This was released alongside the \"Not-A-Flamethrower\" and has become a rare piece of memorabilia for tech enthusiasts and Elon Musk collectors.\n\nProduct Details:\n\nBrand: The Boring Company (Sentry/Tyco Fire Protection)\n\nModel: A02S\n\nCondition: Brand new, still in original shipping box, with original shipping documents\n\nFeatures: Includes mounting hanger hook.\n\nPerfect for display in a garage, office, or man cave. Don't miss out on owning a piece of Boring Company history!\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: TheBoringCompany, ElonMusk, Tesla, SpaceX, Collector, Memorabilia, FireExtinguisher, NotAFlamethrower, RareFind, TechCollectibles\n\nPlease verify all details and specs prior to purchase.",
      "brand": "Boring",
      "size": "",
      "category": "Collectors",
      "condition": "new",
      "tags": "TheBoringCompany, ElonMusk, Tesla, SpaceX, Collector, Memorabilia, FireExtinguisher, NotAFlamethrower, RareFind, TechCollectibles",
      "location": "",
      "notes": "Qty: 2",
      "status": "Active",
      "id": 957,
      "photos": []
    },
    {
      "uuid": "fe252eec-6cfe-4a0f-a94b-21584ed23d33",
      "title": "Rare Tesla Tequila Sipping Glasses Set with Metal Stand",
      "price": 150,
      "cost": 118,
      "description": "Own a piece of the Tesla lifestyle with this limited edition Tesla Sipping Glasses and Stand set. Inspired by the unique silhouette of the Tesla Tequila bottle, these triangular glasses are designed for the ultimate sipping experience.\n\nProduct Details:\n\nBrand: Official Tesla Merchandise\n\nIncludes: Two (2) handcrafted sipping glasses and one (1) polished metal stand.\n\nDesign: Unique, angular glass shape with etched Tesla \"T\" logo.\n\nCondition: Brand new, never used comes in the original premium black gift box with protective foam.\n\nThis is a must-have for any Tesla enthusiast or collector of unique barware.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: Tesla, Tesla Tequila, Sipping Glasses, Barware, Shot Glasses, Tesla Collector, Elon Musk, Gift Idea, Home Bar, Limited Edition\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "",
      "size": "",
      "category": "Collectors",
      "condition": "new",
      "tags": "Tesla, Tesla Tequila, Sipping Glasses, Barware, Shot Glasses, Tesla Collector, Elon Musk, Gift Idea, Home Bar, Limited Edition",
      "location": "",
      "notes": "Qty: 2",
      "status": "Active",
      "id": 958,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO BrickHeadz 40466 Lunar New Year Pandas Exclusive BNIB",
      "price": 25,
      "cost": 10,
      "description": "LEGO BrickHeadz 40466 Lunar New Year Pandas (BNIB)\n\nRETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nA unique BrickHeadz set celebrating the Chinese Lunar New Year with three Panda figures (Adult and two Baby Pandas).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 249 pieces. A key set for BrickHeadz and seasonal collectors.\n\nSearch Tags: 40466, BrickHeadz, Pandas, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40466, BrickHeadz, Pandas, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 892,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/735147809115303",
          "date": "2025-12-15T08:07:14.415Z",
          "id": 73
        }
      ],
      "uuid": "4bad3b32-5df8-47cc-a1a6-903f5a0d29e0",
      "id": 959,
      "photos": []
    },
    {
      "uuid": "76844123-7f65-4b91-94d4-d9ba77e3ddae",
      "title": "RETIRED LEGO Creator 31058 Mighty Dinosaurs 3-in-1 Set BNIB",
      "price": 20,
      "cost": 10,
      "description": "LEGO 31058 Mighty Dinosaurs (BNIB)\n\nRETIRED / DISCONTINUED SET\n\nThe extremely popular and long-running 3-in-1 Creator Set. Build a T. Rex, a Triceratops, or a Pterodactyl.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 174 pieces. Features a posable T. Rex with bright orange eyes and opening mouth.\n\nSearch Tags: 31058, Creator, Dinosaurs, T-Rex, 3in1, Retired, Discontinued, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "31058, Creator, Dinosaurs, T-Rex, 3in1, Retired, Discontinued, LEGO",
      "location": "",
      "notes": "2 - $10ea",
      "status": "Active",
      "id": 960,
      "photos": []
    },
    {
      "uuid": "2f772500-e755-4e9e-b9f7-94b02030fbf6",
      "title": "RARE RETIRED LEGO 40416 Ice Skating Rink Winter Seasonal GWP BNIB",
      "price": 45,
      "cost": 20,
      "description": "LEGO 40416 Ice Skating Rink (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set released in December 2020.\n\nIt features a cute and enchanting rotating ice skating rink playset.\n\nIncludes 304 pieces.\n\nComes with 2 minifigure skaters, wearing never-seen-before winter sweaters.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40416, Ice Skating Rink, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40416, Ice Skating Rink, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "1 - $19.98\n1 - $0\nRetail $27",
      "status": "Active",
      "id": 961,
      "photos": []
    },
    {
      "uuid": "cf601a47-f4d0-479c-a0c4-cb7f006e2097",
      "title": "LEGO 40532 Vintage Taxi Set - 18+ Rare Exclusive - Brand New",
      "price": 40,
      "cost": 0,
      "description": "Add a classic touch to your LEGO city with this rare, limited-edition LEGO 40532 Vintage Taxi. Released in 2022 as an exclusive gift-with-purchase, this 18+ set is designed to perfectly complement the LEGO Modular Buildings line.\n\nProduct Details:\n\nSet Number: 40532.\n\nPiece Count: 163 pieces.\n\nMinifigure: Includes 1 unique taxi driver with a briefcase.\n\nDesign: Beautiful 1930s-style vintage car with a classic black and yellow color scheme.\n\nCondition: [Insert Condition here, e.g., Brand New and Factory Sealed].\n\nIncludes the taxi vehicle, a small piece of sidewalk with a lamppost, and a trash can for a complete street scene.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO 40532, Vintage Taxi, LEGO Icons, Modular Buildings, LEGO Collector, Limited Edition, Toy Car, Gift with Purchase, GWP, Rare LEGO, 18 plus LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO 40532, Vintage Taxi, LEGO Icons, Modular Buildings, LEGO Collector, Limited Edition, Toy Car, Gift with Purchase, GWP, Rare LEGO, 18 plus LEGO",
      "location": "",
      "notes": "RETAIL $19\nPAID $0",
      "status": "Draft",
      "id": 962,
      "photos": []
    },
    {
      "uuid": "ef04e4e7-91d4-49a7-b0c1-6e93323d296b",
      "title": "RARE RETIRED LEGO Star Wars 75306 Imperial Probe Droid BNIB 18+",
      "price": 125,
      "cost": 90,
      "description": "LEGO Star Wars 75306 Imperial Probe Droid (BNIB)\n\nRARE / RETIRED / DISCONTINUED ADULT COLLECTOR SERIES SET\n\nThe set was released in 2021 and retired on December 31, 2022.\n\nIt is a detailed, build-and-display model from Star Wars: The Empire Strikes Back.\n\nThe buildable droid features posable legs and is suspended over a snowy, brick-built scene.\n\nContains 683 pieces.\n\nAges 18+.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 75306, Star Wars, Probe Droid, Hoth, Imperial, Retired, BNIB, Display, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "75306, Star Wars, Probe Droid, Hoth, Imperial, Retired, BNIB, Display, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 963,
      "photos": []
    },
    {
      "uuid": "552dfe02-6f1f-487f-a2cd-3aa0fd543acd",
      "title": "NEW RELEASE LEGO Icons 10352 The Simpsons Krusty Burger BNIB 18+",
      "price": 350,
      "cost": 292,
      "description": "LEGO Icons 10352 The Simpsons: Krusty Burger (BNIB)\n\nBRAND NEW / LATEST COLLECTOR RELEASE (Released June 2025)\n\nThe newest addition to the retired LEGO The Simpsons line, featuring the iconic Krusty Burger restaurant.\n\nThe set contains 1,635 pieces and includes 7 minifigures, including Homer, Bart, and Lisa Simpson, Farmer Krusty, Sideshow Bob, Officer Lou, and the Squeaky-Voiced Teen.\n\nFeatures a detailed, fully enclosed build with a kitchen, dining area, and restroom, plus the Krusty Burger signpost and the Simpsons' Car.\n\nAges 18+.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 10352, Simpsons, Krusty Burger, Icons, Springfield, New, BNIB, Collector, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "10352, Simpsons, Krusty Burger, Icons, Springfield, New, BNIB, Collector, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 964,
      "photos": []
    },
    {
      "uuid": "75639bf8-552f-4786-a98e-e3326ec95395",
      "title": "LEGO 40699 Retro Record Player - Limited Edition GWP - Brand New",
      "price": 65,
      "cost": 0,
      "description": "Celebrate classic audio with the beautiful LEGO Retro Record Player (40699). This limited-edition \"Gift with Purchase\" set features a nostalgic 1950s-inspired design that makes for a perfect display piece in any home or office.\n\nProduct Details:\n\nSet Number: 40699\n\nPiece Count: 310 pieces\n\nDesign: Features a buildable record player with a brick-built vinyl record, a movable needle arm, and a hinged transparent lid.\n\nInteractive Elements: You can manually spin the record and adjust the \"volume\" knobs for a realistic feel.\n\nCondition: Brand new and factory sealed in original packaging.\n\nThis is a rare, non-retail set that is highly collectible for LEGO enthusiasts.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO 40699, Retro Record Player, Vintage, Music, Limited Edition, Gift with Purchase, GWP, Home Decor, Record Player, Rare LEGO, Vinyl Record\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO 40699, Retro Record Player, Vintage, Music, Limited Edition, Gift with Purchase, GWP, Home Decor, Record Player, Rare LEGO, Vinyl Record",
      "location": "",
      "notes": "qty 2 REtails $40, paid 0",
      "status": "Active",
      "id": 965,
      "photos": []
    },
    {
      "uuid": "1ac820db-bb72-49d1-8e0c-645fdd31d53d",
      "title": "Rare LEGO 40697 Halloween Pumpkin (Limited Edition GWP) - Sealed",
      "price": 30,
      "cost": 0,
      "description": "Get into the holiday spirit with the LEGO Creator Halloween Pumpkin (40697). This fun 2-in-1 set allows you to build a classic jack-o'-lantern and includes a light brick to make it glow from within!\n\nProduct Details:\n\nSet Number: 40697\n\nPiece Count: 254 pieces\n\nSpecial Features: Includes a light brick to illuminate the pumpkin and a small ghost companion on a transparent stand.\n\n2-in-1 Build: You can customize the pumpkin's face, choosing between a scary grin or a friendly smile.\n\nCondition: Brand new in original factory-sealed packaging.\n\nThis was a limited-release \"Gift with Purchase\" set, making it a great find for collectors and Halloween fans alike.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Creator, Halloween, Pumpkin, Jack-o-lantern, Light Brick, Limited Edition, Gift with Purchase, GWP, Seasonal, Holiday Decor, Rare LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Creator, Halloween, Pumpkin, Jack-o-lantern, Light Brick, Limited Edition, Gift with Purchase, GWP, Seasonal, Holiday Decor, Rare LEGO",
      "location": "",
      "notes": "qty 2\nRetail $25\n1 - free not sure second?",
      "status": "Active",
      "id": 966,
      "photos": []
    },
    {
      "uuid": "fd623af2-7378-479b-9dc7-35a0f2c76a02",
      "title": "LEGO Minions in Gru’s Lab 75546 - Brand New Factory Sealed",
      "price": 40,
      "cost": 15,
      "description": "Let your little one join the Minions in their secret lair with the LEGO Minions in Gru’s Lab (75546). This 4+ set is specially designed to be fun and easy for younger children to build, featuring a slide, a ramp, and fun accessories from the movie.\n\nProduct Details:\n\nSet Number: 75546.\n\nPiece Count: 87 pieces.\n\nMinifigures: Includes 2 Minion figures: Otto and Kevin.\n\nFeatures: Build Gru’s basement lab with a slide, a vehicle to test, and a \"washing machine\" for the Minions.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Minions, The Rise of Gru, Gru’s Lab, Otto, Kevin, Kids Toys, Building Set, LEGO 75546, Gift Idea, 4 Plus LEGO, Despicable Me\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Minions, The Rise of Gru, Gru’s Lab, Otto, Kevin, Kids Toys, Building Set, LEGO 75546, Gift Idea, 4 Plus LEGO, Despicable Me",
      "location": "",
      "notes": "qty 5 - paid $15ea",
      "status": "Active",
      "id": 967,
      "photos": []
    },
    {
      "uuid": "7971b0f4-2a0d-4d43-bfbf-bc140b85681e",
      "title": "LEGO City Tractor 60287 - 148 Pieces - Brand New Sealed",
      "price": 30,
      "cost": 10,
      "description": "Spark creativity with the LEGO City Tractor (60287). This realistic farm toy features huge rear tires, a tipping loader bucket, and a raising boom, perfect for kids who love heavy machinery and farm life.\n\nProduct Details:\n\nSet Number: 60287\n\nPiece Count: 148 pieces\n\nMinifigures: Includes 2 minifigures (a farmer and daughter) plus a cute rabbit figure.\n\nAccessories: Comes with a crate of pumpkins, apples, and carrots, plus 2 hay bales for realistic farm play.\n\nFeatures: A tipping loader bucket and a boom that lifts up and down.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO City, Tractor, Farm Toys, Great Vehicles, Building Set, LEGO 60287, Gift Idea, Kids Toys, Collectible LEGO, Farm Life\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO City, Tractor, Farm Toys, Great Vehicles, Building Set, LEGO 60287, Gift Idea, Kids Toys, Collectible LEGO, Farm Life",
      "location": "",
      "notes": "qty 2",
      "status": "Active",
      "id": 968,
      "photos": []
    },
    {
      "uuid": "fb4620e3-d8cd-4b5d-91cd-bf23a5d3af9e",
      "title": "RARE RETIRED LEGO 910034 BRICK CROSS BNIB",
      "price": 450,
      "cost": 392,
      "description": "LEGO 910034 Brick Cross Train Station (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 2 (Only 30,000 made).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 3,050-piece Modular Building Train Station model with 8 Minifigures!\n\nSearch Tags: 910034, BrickLink, BDP, Exclusive, Retired, Modular, Train, Station, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910034, BrickLink, BDP, Exclusive, Retired, Modular, Train, Station, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 969,
      "photos": []
    },
    {
      "uuid": "7ce3cf1a-9520-4c96-bc4b-39d81b89119a",
      "title": "RARE RETIRED LEGO 910050 Antique Shop BDP Modular BNIB",
      "price": 300,
      "cost": 224,
      "description": "LEGO 910050 Antique Shop (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited to 30,000 made).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Detailed 1,918-piece Modular Building model with 6 Minifigures!\n\nSearch Tags: 910050, BrickLink, BDP, Exclusive, Retired, Modular, Shop, Antique, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910050, BrickLink, BDP, Exclusive, Retired, Modular, Shop, Antique, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 970,
      "photos": []
    },
    {
      "uuid": "4633bed9-d4f7-43ba-8f3a-4f89a3278b34",
      "title": "RARE RETIRED LEGO 910051 Mushroom Village BDP Exclusive BNIB",
      "price": 450,
      "cost": 303,
      "description": "LEGO 910051 Mushroom Village (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited to 30,000 made).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Detailed 2,427-piece model of a miniature world with 7 Minifigures!\n\nSearch Tags: 910051, BrickLink, BDP, Exclusive, Retired, Mushroom, Village, Fantasy, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910051, BrickLink, BDP, Exclusive, Retired, Mushroom, Village, Fantasy, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 971,
      "photos": []
    },
    {
      "uuid": "8d001381-bd2b-4c8d-a236-e37085e26386",
      "title": "RARE RETIRED LEGO 910053 The Thieves of Tortuga BDP Exclusive BNIB",
      "price": 550,
      "cost": 482,
      "soldPrice": 482,
      "description": "LEGO 910053 The Thieves of Tortuga (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 4,002-piece Pirate-themed model with 10 Minifigures!\n\nSearch Tags: 910053, BrickLink, BDP, Exclusive, Retired, Pirates, Tortuga, Island, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910053, BrickLink, BDP, Exclusive, Retired, Pirates, Tortuga, Island, LEGO",
      "location": "",
      "notes": "",
      "status": "Sold",
      "id": 972,
      "photos": []
    },
    {
      "uuid": "09a8882a-275f-45c1-b20a-7d0003146791",
      "title": "RARE RETIRED LEGO 910043 Forest Stronghold BDP Exclusive BNIB",
      "price": 600,
      "cost": 426,
      "description": "LEGO 910043 Forest Stronghold (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 3,395-piece Castle/Forest-themed model!\n\nSearch Tags: 910043, BrickLink, BDP, Exclusive, Retired, Castle, Forest, Stronghold, Medieval, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910043, BrickLink, BDP, Exclusive, Retired, Castle, Forest, Stronghold, Medieval, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 973,
      "photos": []
    },
    {
      "uuid": "5901a607-ad7a-4022-bab3-e412e5fa500e",
      "title": "RARE RETIRED LEGO 910036 Ocean House BDP Exclusive BNIB",
      "price": 375,
      "cost": 292,
      "description": "LEGO 910036 Ocean House (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 3 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Detailed 2,207-piece stilt-house model with 4 Minifigures!\n\nSearch Tags: 910036, BrickLink, BDP, Exclusive, Retired, Ocean, House, Beach, Tropical, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910036, BrickLink, BDP, Exclusive, Retired, Ocean, House, Beach, Tropical, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 974,
      "photos": []
    },
    {
      "uuid": "dc4b795a-4d2c-4087-9212-450c401de06c",
      "title": "RARE RETIRED LEGO 910038 Ominous Isle BDP Exclusive BNIB",
      "price": 450,
      "cost": 347,
      "description": "LEGO 910038 Ominous Isle (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 3 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 2,809-piece Pirate/Adventure-themed model!\n\nSearch Tags: 910038, BrickLink, BDP, Exclusive, Retired, Ominous, Isle, Pirates, Adventure, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910038, BrickLink, BDP, Exclusive, Retired, Ominous, Isle, Pirates, Adventure, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 975,
      "photos": []
    },
    {
      "uuid": "bd821f11-35a0-40f9-b85d-c14b39d5340a",
      "title": "RARE RETIRED LEGO 910048 Riverside Scholars BDP Exclusive BNIB",
      "price": 400,
      "cost": 292,
      "description": "LEGO 910048 Riverside Scholars (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Detailed 2,769-piece Medieval/Fantasy-themed building with 6 Minifigures!\n\nSearch Tags: 910048, BrickLink, BDP, Exclusive, Retired, Castle, Fantasy, Scholars, Medieval, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910048, BrickLink, BDP, Exclusive, Retired, Castle, Fantasy, Scholars, Medieval, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 976,
      "photos": []
    },
    {
      "uuid": "2fea3d17-5dd0-43e8-8b92-52aa740b0418",
      "title": "RARE RETIRED LEGO 910047 Medieval Seaside Market BDP Exclusive BNIB",
      "price": 500,
      "cost": 336,
      "description": "LEGO 910047 Medieval Seaside Market (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Limited run).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 2,560-piece Castle/Market-themed model!\n\nSearch Tags: 910047, BrickLink, BDP, Exclusive, Retired, Medieval, Castle, Market, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910047, BrickLink, BDP, Exclusive, Retired, Medieval, Castle, Market, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 977,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO 40516 Everyone is Awesome Exclusive Set BNIB",
      "price": 60,
      "cost": 50,
      "description": "LEGO 40516 Everyone is Awesome (BNIB)\n\nRETIRED / DISCONTINUED EXCLUSIVE SET\n\nA unique rainbow display model featuring 11 monochromatic minifigures.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 346 pieces. A popular collector's piece.\n\nSearch Tags: 40516, Everyone is Awesome, Rainbow, Exclusive, Retired, BNIB, Display, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40516, Everyone is Awesome, Rainbow, Exclusive, Retired, BNIB, Display, LEGO",
      "location": "",
      "notes": "Qty: 2\nRetail is $50.40, I paid $22.50 for two of them.",
      "status": "Sold",
      "listings_backup": [
        {
          "itemId": 911,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/1219495340055423",
          "date": "2025-12-15T08:08:26.088Z",
          "id": 88
        }
      ],
      "uuid": "7f52340a-58c9-4516-b011-955ae29cd5fa",
      "id": 978,
      "soldPrice": 60,
      "photos": []
    },
    {
      "uuid": "2de6c35f-fa23-4e53-b5c4-e5caf3f2f59c",
      "title": "RETIRED LEGO Creator 31118 Surfer Beach House 3-in-1 Set BNIB",
      "price": 100,
      "cost": 78.4,
      "description": "LEGO 31118 Surfer Beach House (NISB)\n\nRETIRED / DISCONTINUED SET\n\nHighly popular 3-in-1 Creator Set. Build a Beach House, a Lighthouse, or a Surf Shack!\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 564 pieces. Great for building and display.\n\nSearch Tags: 31118, Creator, Beach House, Surfer, 3in1, Retired, Discontinued, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "31118, Creator, Beach House, Surfer, 3in1, Retired, Discontinued, LEGO",
      "location": "",
      "notes": "Qty: 2",
      "status": "Active",
      "id": 979,
      "photos": []
    },
    {
      "uuid": "9596726a-a506-4060-9ee5-cdc9afaa2e8a",
      "title": "RARE RETIRED LEGO 40491 Year of the Tiger Seasonal Exclusive BNIB",
      "price": 20,
      "cost": 0,
      "description": "LEGO 40491 Year of the Tiger (BNIB)\n\nRETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nCelebrates the Chinese New Year (Year of the Tiger). Highly collectible promotional item (GWP).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 193 pieces. A key piece for collectors of the Lunar New Year series.\n\nSearch Tags: 40491, Year of the Tiger, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40491, Year of the Tiger, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty:5\nRetail $13 ",
      "status": "Active",
      "id": 980,
      "photos": []
    },
    {
      "uuid": "dddf3295-bd06-4994-87c6-e9083fb9aed0",
      "title": "RARE RETIRED LEGO 40486 Adidas Originals Superstar Mini Build Exclusive BNIB",
      "price": 40,
      "cost": 12.58,
      "description": "LEGO 40486 Adidas Originals Superstar (BNIB)\n\nRETIRED / DISCONTINUED EXCLUSIVE SET\n\nRare promotional Adidas x LEGO collaboration mini build of the iconic Superstar shoe.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 92 pieces. Great small set for collectors of both brands.\n\nSearch Tags: 40486, Adidas, Superstar, Originals, Mini Build, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40486, Adidas, Superstar, Originals, Mini Build, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty: 4\n1 - $12.58\n3 - $0\nRetail $17",
      "status": "Active",
      "id": 981,
      "photos": []
    },
    {
      "uuid": "d3cb8e96-4bca-48ab-9fc4-ae1c8f3a876c",
      "title": "RARE RETIRED LEGO Ideas 40487 Sailboat Adventure Exclusive BNIB",
      "price": 45,
      "cost": 25.9,
      "description": "LEGO 40487 Sailboat Adventure (BNIB)\n\nRETIRED / DISCONTINUED EXCLUSIVE SET\n\nA beautiful, detailed model that was a limited-time Gift With Purchase (GWP) item.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 330 pieces. Includes 2 Minifigures and two dolphins!\n\nSearch Tags: 40487, Ideas, Sailboat, Adventure, GWP, Gift With Purchase, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40487, Ideas, Sailboat, Adventure, GWP, Gift With Purchase, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty: 8\n1 - $25.90\n7 - $0.00\nRetail $35",
      "status": "Active",
      "id": 982,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO BrickHeadz 41599 Wonder Woman DC Comics BNIB",
      "price": 30,
      "cost": 10,
      "description": "LEGO BrickHeadz 41599 Wonder Woman (BNIB)\n\nRARE / RETIRED / DISCONTINUED COLLECTIBLE SET\n\nThis set was released in 2018 and features authentic details from the Justice League movie.\n\nIt is a retired BrickHeadz DC Comics character.\n\nThe figure includes a detachable sword and shield.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 143 pieces. Suitable for ages 10+.\n\nSearch Tags: 41599, BrickHeadz, Wonder Woman, DC Comics, Justice League, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "41599, BrickHeadz, Wonder Woman, DC Comics, Justice League, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty: 2\n$10 ea",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 916,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/1592586661732236",
          "date": "2025-12-16T07:00:53.068Z",
          "id": 93
        }
      ],
      "uuid": "56051dad-01ba-4030-ab0d-c3a3e04908e6",
      "id": 983,
      "photos": []
    },
    {
      "uuid": "04b5e8eb-f29f-4524-b12a-1fef461f13a9",
      "title": "RARE RETIRED LEGO 40410 Charles Dickens A Christmas Carol GWP BNIB",
      "price": 40,
      "cost": 22.2,
      "description": "LEGO 40410 Charles Dickens Tribute (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) in November 2020 for purchases over $150.\n\nThe set is a tribute to Charles Dickens and depicts a scene from his classic holiday tale, A Christmas Carol.\n\nIt includes a unique brick-built book spine base with a small, secret drawer.\n\nThe set contains 333 pieces and 3 exclusive minifigures: Ebenezer Scrooge, Bob Cratchit, and Tiny Tim.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40410, Dickens, Christmas Carol, Scrooge, GWP, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40410, Dickens, Christmas Carol, Scrooge, GWP, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "QTY: 6\n3 - $10EA\n1 - $22.20\n2 - $0\nRETAIL $30",
      "status": "Active",
      "id": 984,
      "photos": []
    },
    {
      "uuid": "de32d219-7578-430d-9167-a2bc416671c0",
      "title": "RARE RETIRED LEGO 40484 Santa's Front Yard Winter Seasonal GWP BNIB",
      "price": 25,
      "cost": 0,
      "soldPrice": 0,
      "description": "LEGO 40484 Santa's Front Yard (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set released in November 2021 with a high spending threshold.\n\nThe set contains 317 pieces and includes a buildable reindeer figure and an elf minifigure.\n\nIt depicts a charming icy, moonlit setting in Santa's front yard with a snow-covered North Pole sign and trees.\n\nThe elf is shown feeding the reindeer a carrot by a clear stream.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty: 4 (3 left)\nRETAIL $27 PAID ZERO FOR ALL",
      "status": "Active",
      "id": 985,
      "photos": []
    },
    {
      "uuid": "aabf3a98-deae-4657-9628-c672ed010f16",
      "title": "VINTAGE RARE RETIRED LEGO 6289 Red Beard Runner Pirate Ship BNIB",
      "price": 950,
      "cost": 792.96,
      "description": "LEGO 6289 Red Beard Runner (BNIB)\n\nULTRA-RARE / VINTAGE / RETIRED CLASSIC PIRATES SET (Released 1996)\n\nOne of the largest and most iconic pirate ships from the classic LEGO Pirates theme.\n\nThe set contains 691 pieces (the box states 691) and 7 minifigures, including Captain Redbeard.\n\nFeatures three working cannons and iconic black and white striped sails.\n\nOriginal box dimensions are 20-7/8\" by 17\" by 2-3/4\".\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 6289, Red Beard Runner, Pirates, Vintage, Classic, Retired, BNIB, Ship, Captain Redbeard, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "6289, Red Beard Runner, Pirates, Vintage, Classic, Retired, BNIB, Ship, Captain Redbeard, LEGO",
      "location": "",
      "notes": "Qty :3\n3 - $792.96\n",
      "status": "Active",
      "id": 986,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO 40700 Winter Holiday Train Seasonal GWP BNIB",
      "price": 25,
      "cost": 0,
      "description": "LEGO 40700 Winter Holiday Train (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set, available during the 2024 holiday period.\n\nThe model features a steam locomotive with two detachable carriages.\n\nThe carriages carry wrapped presents and a Christmas tree that can spin around.\n\nThe set contains 294 pieces.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty :3 sold 1, Qty:2\nRETAIL $25\nKat - ?\nChristine?\nCarrie - \nMegan - sold\nSabrina?",
      "status": "Sold",
      "listings_backup": [
        {
          "itemId": 920,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/2414821018962015",
          "date": "2025-12-16T06:58:05.200Z",
          "id": 97
        }
      ],
      "uuid": "135122af-0459-41ac-8845-b0eab7607e3b",
      "id": 987,
      "soldPrice": 25,
      "photos": []
    },
    {
      "uuid": "ad16d717-1458-4507-b3df-c493b9407f2f",
      "title": "HIGHLY EXCLUSIVE LEGO 910049 Adventure in Transylvania BNIB",
      "price": 600,
      "cost": 504,
      "description": "LEGO 910049 Transylvania Castle (BNIB)\n\nEXTREMELY RARE & DISCONTINUED LIMITED EDITION SET\n\nHighly collectible BrickLink Designer Program (BDP) Series 5 (Only 30,000 made).\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSize: Massive 4,056-piece model with 15 Minifigures!\n\n\n\n\n\nSearch Tags: 910049, BrickLink, BDP, Exclusive, Retired, Castle, LEGO.",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "910049, BrickLink, BDP, Exclusive, Retired, Castle, LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 988,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910031 General Store (Copy)",
      "price": 350,
      "cost": 235,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "5e744b94-ca20-4f93-8a56-1a675703bca9",
      "id": 989,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910030 Snack Shack (Copy)",
      "price": 150,
      "cost": 73,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910030, snack, shack, snack shack, trailer",
      "brand": "Lego",
      "size": "",
      "category": "Toy",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910030, snack, shack, snack shack, trailer",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "e7bc5687-6993-47ad-aba8-86416467bfd0",
      "id": 990,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910042 Lost City (Copy)",
      "price": 475,
      "cost": 392,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910042, Lost city, lost, city, castle",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910042, Lost city, lost, city, castle",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "9fb22195-d4d6-4efb-8cc1-1e0e6aa70b13",
      "id": 991,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910032 Parisian Street (Copy)",
      "price": 600,
      "cost": 470,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910032, Parisian, parisian street, building, bistro, store",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910032, Parisian, parisian street, building, bistro, store",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "63de254c-4196-458c-8759-bbd576a8d9b7",
      "id": 992,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910046 Merchant Boat (Copy)",
      "price": 350,
      "cost": 245,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910046, boat, merchant boat, merchant, fishing, house boat, house",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910046, boat, merchant boat, merchant, fishing, house boat, house",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "7ee0e301-3535-4fd3-a65d-6abc832acab1",
      "id": 993,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910040 Harbormasters Office (Copy)",
      "price": 400,
      "cost": 292,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910040, Office, Harbormasters, harbormasters office ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910040, Office, Harbormasters, harbormasters office ",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "db0f7491-91c1-46ea-96bf-f4a6a6fafd95",
      "id": 994,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910039 The Art of Chocolate (Copy)",
      "price": 450,
      "cost": 336,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego,art of chocolate, bricklink, chocolate, limited, 910039, rare ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,art of chocolate, bricklink, chocolate, limited, 910039, rare ",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "e772b09f-38f9-4403-93b1-5d328ed7e1a1",
      "id": 995,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910044 Wild West Train (Copy)",
      "price": 500,
      "cost": 392,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego, old train engine, 910044, bricklink, train, wild west, 910044, ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego, old train engine, 910044, bricklink, train, wild west, 910044, ",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "fbc3b5dd-64ce-40bf-9c86-e88e19454b29",
      "id": 996,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910033 Old Train Engine Shed (Copy)",
      "price": 450,
      "cost": 336,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego, old train engine shed, 910033, bricklink, train, engine",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego, old train engine shed, 910033, bricklink, train, engine",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "5ca94fd4-9237-4da7-aaf2-5a36b8dc24bd",
      "id": 997,
      "photos": []
    },
    {
      "uuid": "c4cbc955-7aa0-41be-9518-55e284057737",
      "title": "RARE RETIRED LEGO 40417 Year of the Ox Seasonal Exclusive BNIB",
      "price": 20,
      "cost": 9.62,
      "description": "LEGO 40417 Year of the Ox (BNIB)\n\nRETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nCelebrates the Lunar New Year (Year of the Ox). Highly collectible seasonal item.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 168 pieces. Great small set for collectors.\n\nSearch Tags: 40417, Year of the Ox, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40417, Year of the Ox, Lunar New Year, Seasonal, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "qty: 2 \n1 - $9.62ea\n2 - $2.46ea",
      "status": "Active",
      "id": 998,
      "photos": []
    },
    {
      "uuid": "092ebfd4-768c-4bac-8c3e-04ae2fe61119",
      "title": "Lego Bricklink LIMITED EDITION #910032 Parisian Street",
      "price": 600,
      "cost": 470,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910032, Parisian, parisian street, building, bistro, store",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910032, Parisian, parisian street, building, bistro, store",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 999,
      "photos": []
    },
    {
      "uuid": "6ea37c77-f857-4a66-b588-db35708b6b86",
      "title": "Lego Bricklink LIMITED EDITION #910042 Lost City",
      "price": 475,
      "cost": 392,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910042, Lost city, lost, city, castle",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910042, Lost city, lost, city, castle",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1000,
      "photos": []
    },
    {
      "uuid": "1a254517-2ceb-46ac-8715-ed71e2e72451",
      "title": "Lego Bricklink LIMITED EDITION #910030 Snack Shack",
      "price": 150,
      "cost": 73,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910030, snack, shack, snack shack, trailer",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910030, snack, shack, snack shack, trailer",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1001,
      "photos": []
    },
    {
      "uuid": "d6c50178-8546-4909-86c2-bf47204b276d",
      "title": "Lego Bricklink LIMITED EDITION #910031 General Store",
      "price": 350,
      "cost": 235,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1002,
      "photos": []
    },
    {
      "uuid": "1bedce0d-4fc9-4616-8cb4-a047d7169319",
      "title": "Lego Bricklink LIMITED EDITION #910045 Siege Encampent",
      "price": 450,
      "cost": 336,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1003,
      "photos": []
    },
    {
      "uuid": "bdb56cdc-7f62-4790-bdfe-f02aa5797027",
      "title": "Lego Bricklink LIMITED EDITION #910003 Mountain Windmill",
      "price": 600,
      "cost": 258,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910003, mountain windmill, windmill, mountain, fortress",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1004,
      "photos": []
    },
    {
      "uuid": "1579f603-49cd-433d-8583-d030d300ce60",
      "title": "Lego Bricklink LIMITED EDITION #910009 Modular Lego Store",
      "price": 650,
      "cost": 258,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910009, Modular, lego, store, lego store, modular lego store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910009, Modular, lego, store, lego store, modular lego store, building",
      "location": "",
      "notes": "",
      "status": "Sold",
      "id": 1005,
      "soldPrice": 600,
      "dateSold": "2025-12-24T01:50:16.576Z",
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910009 Modular Lego Store (Copy)",
      "price": 650,
      "cost": 258,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910009, Modular, lego, store, lego store, modular lego store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910009, Modular, lego, store, lego store, modular lego store, building",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "d5ad4214-ab08-4595-bb41-9aef97debe3c",
      "id": 1006,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910003 Mountain Windmill (Copy)",
      "price": 600,
      "cost": 258,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910003, mountain windmill, windmill, mountain, fortress",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "0ac19308-dd4e-4d34-9f43-45980787e22e",
      "id": 1007,
      "photos": []
    },
    {
      "title": "Lego Bricklink LIMITED EDITION #910045 Siege Encampent (Copy)",
      "price": 350,
      "cost": 235,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910031, General, store, general store, building",
      "location": "",
      "notes": "",
      "status": "Draft",
      "isHidden": true,
      "parentBundleId": 57,
      "listings_backup": [],
      "uuid": "f25bfbbd-822c-46fe-85c0-c8d26df47ea8",
      "id": 1008,
      "photos": []
    },
    {
      "title": "911/718 Graphite Blue carpet floor mats",
      "price": 150,
      "cost": 0,
      "description": "Never used Graphite Blue floor mats fromm a 2024 GTS 4.0 718 Boxster. They are in excellent condition, I bought different ones and still have the factory Original. Photo is pretty bad to show the color. Message if you want more details. Two piece driver and passenger and I believe these fit in 911's. $150 OBO",
      "brand": "",
      "size": "",
      "category": "Car",
      "condition": "new",
      "tags": "porsche, floor mats, floor, mats, graphite blue, blue, carpet",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 942,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/2570181026693791",
          "date": "2025-11-30T02:02:17.457Z",
          "id": 107
        }
      ],
      "uuid": "29a1ebae-cb5f-470d-be28-629e76a0c67f",
      "id": 1009,
      "photos": []
    },
    {
      "title": "Uniden Appcam Solo - Security Camera",
      "price": 50,
      "cost": 0,
      "description": "Brand new, never used. Been sitting around for awhile, I think it comes with a battery but it might need a new one. Never opened, never used. Really don't know too much about it.",
      "brand": "Uniden",
      "size": "",
      "category": "Camera",
      "condition": "new",
      "tags": "security, camera, app, cam, uniden, security cam, 1080p",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 943,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/865829675784248",
          "date": "2025-11-30T02:10:09.611Z",
          "id": 108
        }
      ],
      "uuid": "8c21eb2e-b265-48b9-bb05-c132d2b564ba",
      "id": 1010,
      "photos": []
    },
    {
      "title": "Solid steel Fixture table",
      "price": 3200,
      "cost": 500,
      "description": "20' long, 5' wide. Custom Solid steel fixture/manufacturing table. Comes pre wired for power plugs through the table. It takes two fork lifts or one larger forklift to lift it. I would guess its around 4,000 lbs or so. Flat decks can transport pretty easily. Any questions please reach out.",
      "brand": "",
      "size": "",
      "category": "Commercial",
      "condition": "good",
      "tags": "Steel table, fixture table, manufactuing, lighting, steel, ",
      "location": "",
      "notes": "I posted a video which is not saved in here.",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 944,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/1539628587340032",
          "date": "2025-12-01T03:44:58.995Z",
          "id": 109
        }
      ],
      "uuid": "9d89b35d-0da1-41af-85f4-5e07359967fd",
      "id": 1011,
      "photos": []
    },
    {
      "title": "Commercial Ventilated Ladder Tray/Raceway",
      "price": 1234,
      "cost": 0,
      "description": "CER Raceway - CSA approved - Brand new already on skids, 10' lengths and good to go. \n\nMessage for more details or questions.\n\nLocated in Aldergrove.\n\nCER Raceway - CSA approved - Brand new already on skids, 10' lengths and good to go. \n\nMessage for more details or questions.\n\nLocated in Aldergrove.\n\nCan sell via cash or couuld sell through an incorporated business complete with invoice.\n\nOpen to offers, The ladder tray alone sells over $200 wholesale per piece. Buy the entire lot for a massive fraction of the cost\n\nApprox\n2,320' - VCA63-12 12\" x 6\" Ventilated Ladder Tray\n15 - 12\" Tee - 12R\n24 - 12\" H90 - 12R\n20 - VCA63 - VADJ Vert ADJ coupling\n17 - VCA63 - HADJ Horiz ADJ coupling\n220' - BT4-12 12\" x 4\" Basket Tray, electro plated\n6 - BT-Tee kit\n44 - BT-H90-KIT\n\nCan ship to site or office\n\nTags: ladder, ladder tray, tray, cable, cable tray, aluminum, aluminum tray, raceway, wire, wire raceway, rung, rungs, commercial, CER, Cul, CSA, certified, industrial",
      "brand": "CER",
      "size": "",
      "category": "Commercial",
      "condition": "new",
      "tags": "CER, Ladder tray, cable tray, tray, aluminum, raceway",
      "location": "",
      "notes": "",
      "status": "Active",
      "listings_backup": [
        {
          "itemId": 945,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/1340745167782211",
          "date": "2025-12-01T21:00:57.162Z",
          "id": 110
        }
      ],
      "uuid": "2b30a087-161d-47e6-afbe-798435a3458f",
      "id": 1012,
      "photos": []
    },
    {
      "title": "Ski boots ",
      "price": 0,
      "cost": 0,
      "description": "\n\n- NEW FISCHER RC4 JR 100 SKI BOOTS - SIZE 5.5 \n- NEW FISCHER RC4 JR 70 TMS SKI BOOTS - SIZE 4 \t \n- NEW FISCHER SOMA RC4 80 JR SKI BOOTS - SIZE 5.5  \n- NEW FISCHER RC4 100 JR VACUUM SKI BOOTS - SIZE 4.5 \t \n- NEW FISCHER TRINITY 110 VACUUM SKI BOOTS - SIZE 5.5 \n- NEW FISCHER RC4 100 JR VACUUM SKI BOOTS - SIZE 5.5 \t \n- NEW FISCHER RC4 J70 SKI BOOTS - SIZE 4.5  \n- NEW FISCHER RC4 WORLD CUP JR 100 SKI BOOTS - SIZE 4.5 \t \n- NEW FISCHER RC4 JR 80 SKI BOOTS - SIZE 4 \t \n- NEW FISCHER RC4 VACUUM PRO 130 SKI BOOTS - SIZE 4.5 \t \n- NEW FISCHER RC4 100 JR VACUUM SKI BOOTS - SIZE 4.5  \n- NEW FISCHER RC4 100 JR VACUUM SKI BOOTS - SIZE 4.5 \t \n- NEW FISCHER RC4 80 THERMOSHAPE SKI BOOTS - SIZE 4.5 \t \n- NEW FISCHER RC4 PODIUM 70 SKI BOOTS - SIZE 3.5 \t \n- NEW FISCHER RC4 100 VACUUM JR SKI BOOTS - SIZE 4.5  \n- NEW FISCHER RC4 70 JR THERMOSHAPE SKI BOOTS - SIZE 3.5 \t \n- NEW ATOMIC REDSTER WORLD CUP 90 SKI BOOTS - SIZE 6.5 \t \n- NEW ATOMIC REDSTER PRO 80 SKI BOOTS - SIZE 5.5 \t \n- NEW ATOMIC REDSTER FIS 70 SKI BOOTS - SIZE 5 / 5.5 \t \n- NEW ATOMIC REDSTER PRO 80 SKI BOOTS - SIZE 4.5 \t \n- NEW DALBELLO SCORPION 130 SKI BOOTS - SIZE 9\t \n- NEW ATOMIC REDSTER WC 70 SKI BOOTS - SIZE 5.5\n- NEW ATOMIC REDSTER WORLD CUP 90 SKI BOOTS - SIZE 4.5  \n- NEW NORDICA DOBERMAN GP 90 SKI BOOTS - SIZE 4.5 \t \n- NEW NORDICA DOBERMANN WC 110 SKI BOOTS - SIZE 4 \t \n- NEW HEAD RAPTOR 70 SKI BOOTS - SIZE 4.5 \n- NEW HEAD RAPTOR 70 RS SKI BOOTS - SIZE 3  \n- NEW HEAD RAPTOR 90 RS SKI BOOTS - SIZE 5.5 ",
      "brand": "",
      "size": "",
      "category": "",
      "condition": "new",
      "tags": "",
      "location": "",
      "notes": "",
      "status": "Draft",
      "listings_backup": [],
      "uuid": "ad5235d7-4692-49a2-894c-47e0b6743513",
      "id": 1013,
      "photos": []
    },
    {
      "uuid": "1a6ada5b-0980-4e33-971c-6831afa0d058",
      "title": "Lego Bricklink LIMITED EDITION #910033 Old Train Engine Shed",
      "price": 450,
      "cost": 336,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego, old train engine shed, 910033, bricklink, train, engine",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego, old train engine shed, 910033, bricklink, train, engine",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1014,
      "photos": []
    },
    {
      "uuid": "285333ad-2b69-4caa-9a4f-1f57b45667b5",
      "title": "Lego Bricklink LIMITED EDITION #910044 Wild West Train",
      "price": 500,
      "cost": 392,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego, old train engine, 910044, bricklink, train, wild west, 910044, ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego, old train engine, 910044, bricklink, train, wild west, 910044, ",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1015,
      "photos": []
    },
    {
      "uuid": "903671ed-edf6-4389-ad91-e17043a6ce61",
      "title": "Lego Bricklink LIMITED EDITION #910039 The Art of Chocolate",
      "price": 450,
      "cost": 336,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\n\nTags: lego,art of chocolate, bricklink, chocolate, limited, 910039, rare ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,art of chocolate, bricklink, chocolate, limited, 910039, rare ",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1016,
      "photos": []
    },
    {
      "uuid": "6217671c-2dd9-43f1-8d75-5436456f1541",
      "title": "Lego Bricklink LIMITED EDITION #910040 Harbormasters Office",
      "price": 400,
      "cost": 292,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910040, Office, Harbormasters, harbormasters office ",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910040, Office, Harbormasters, harbormasters office ",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1017,
      "photos": []
    },
    {
      "uuid": "729faa20-1245-466f-a1f8-194aefb54be6",
      "title": "Lego Bricklink LIMITED EDITION #910046 Merchant Boat",
      "price": 350,
      "cost": 245,
      "description": "Only 10,000 are made world wide, limited edition.\n\nBrand New Factory Sealed\n\nPickup around Guildford or might be able to meet in Coquitlam, Langley, Abbotsford and possibly out towards Vancouver\n\n\nTags: lego,bricklink, limited, rare, 910046, boat, merchant boat, merchant, fishing, house boat, house",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "lego,bricklink, limited, rare, 910046, boat, merchant boat, merchant, fishing, house boat, house",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1018,
      "photos": []
    },
    {
      "uuid": "14dab2e5-7ff7-45c1-b213-f5658c922141",
      "title": "Samsara Fleet Management Lot - VG34 Gateways & CM32 Dash Cams",
      "price": 200,
      "cost": 0,
      "description": "Professional fleet tracking and safety hardware from Samsara. This bundle includes multiple Vehicle Gateway units and AI Dash Cams, perfect for a business looking to expand their fleet tracking or replace existing hardware.\n\nIncluded in this listing:\n\nSamsara VG34 Vehicle Gateways: High-speed GPS tracking and engine diagnostics units.\n\nSamsara CM32 AI Dash Cams: High-definition cameras for driver safety and incident recording.\n\nAccessories: Includes original boxes, wiring harnesses/cables, and \"Vehicle Gateway\" install guides as pictured.\n\nCondition: Excellent condition; New.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: Samsara, Fleet Tracking, GPS Tracker, Dash Cam, Business Equipment, Trucking, Logistics, VG34, CM32, Vehicle Gateway, AI Camera, Fleet Safety\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Samsara",
      "size": "",
      "category": "Electronics",
      "condition": "new",
      "tags": "Samsara, Fleet Tracking, GPS Tracker, Dash Cam, Business Equipment, Trucking, Logistics, VG34, CM32, Vehicle Gateway, AI Camera, Fleet Safety",
      "location": "",
      "notes": "RJCross paid",
      "status": "Active",
      "id": 1020,
      "photos": []
    },
    {
      "uuid": "2640dd7c-14a4-468c-ad6e-bfbaa4dda79e",
      "title": "Mercedes C63S AMG Performance Brake Pad Lot - Porterfield R4/R4-S and OEM",
      "price": 250,
      "cost": 0,
      "description": "Up for sale is a collection of high-performance Porterfield Carbon Kevlar brake pads previously used on a Mercedes-Benz C63S AMG. These are top-tier pads known for being extremely rotor-friendly while providing significantly better stopping power also have OEM pads with lots of life left.\n\nIncluded in this lot:\n\nFront Pads (AP 1291): Features the high-performance R4-S compound, ideal for heavy-duty street and light track use.\n\nRear Pads (AP 1669): Includes R-4 Racing and R4-S compounds.\n\nCondition: Mixed set including used and like-new pads (approx. 60–70% life remaining as marked on boxes).\n\nCompatibility: Specifically fits W205 C63 and C63S AMG models with iron discs/red calipers. Also compatible with various E63 and S63 AMG models.\n\nWhy Porterfield?\n\nCarbon Kevlar Material: Absorbs and dissipates heat evenly for consistent modulation.\n\nLow Dust/Noise: The R4-S compound is specifically designed for minimal brake dust and quiet operation compared to track-only pads.\n\nFast Warm-up: Requires minimal bed-in and reaches operating temperature quickly.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: Mercedes, C63S, AMG, W205, Porterfield, Brake Pads, Racing Brakes, Carbon Kevlar, AP1291, AP1669, Performance Parts, C63 AMG, E63 AMG, S63 AMG\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "",
      "size": "",
      "category": "Car",
      "condition": "good",
      "tags": "Mercedes, C63S, AMG, W205, Porterfield, Brake Pads, Racing Brakes, Carbon Kevlar, AP1291, AP1669, Performance Parts, C63 AMG, E63 AMG, S63 AMG",
      "location": "",
      "notes": "misc cost not sure",
      "status": "Active",
      "id": 1021,
      "photos": []
    },
    {
      "uuid": "0e4b1722-ed67-40f1-bc74-39fb22384132",
      "title": "Electrical Switch Bundle - Countdown Timers, 7-Day Digital & Motion Sensors",
      "price": 100,
      "cost": 0,
      "description": "A complete bundle of brand-new, in-wall electrical switches and timers. These units are perfect for automating your home lighting, fans, or heaters to save on energy costs.\n\nIncluded in this lot (11 units total):\n\n6-Button Preset Countdown Timers (4 units): Simple \"one-touch\" buttons for timed shut-off. Ideal for bathroom fans or garage lights.\n\n7-Day Programmable Digital Timers (4 units): Fully customizable with a digital display. Perfect for security lighting while you're away.\n\nMotion Sensor / Occupancy Switches (2 units): Automatically turns lights on when you enter a room and off when you leave.\n\nSlide Dimmer (1 unit): 700W capacity with a sleek slide control for precise dimming.\n\nCondition: All items are brand new and factory-sealed in their original retail packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: Wall Timer, Motion Sensor, Dimmer Switch, Home Automation, Energy Saving, Electrical Supplies, Digital Timer, Countdown Timer, Occupancy Sensor, Renovation, Bulk Lot, Home Improvement\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "",
      "size": "",
      "category": "Electrical",
      "condition": "new",
      "tags": "Wall Timer, Motion Sensor, Dimmer Switch, Home Automation, Energy Saving, Electrical Supplies, Digital Timer, Countdown Timer, Occupancy Sensor, Renovation, Bulk Lot, Home Improvement",
      "location": "",
      "notes": "never paid anything",
      "status": "Active",
      "id": 1022,
      "photos": []
    },
    {
      "uuid": "91b7ce75-cd75-4ff6-9a5e-c3ed24c3b2e2",
      "title": "LEGO Super Mario Adventures with Peach Starter Course 71403 - Brand New",
      "price": 100,
      "cost": 84,
      "description": "Jump into the world of LEGO Super Mario with the Adventures with Peach Starter Course (71403). This interactive set features a digital LEGO Peach figure that gives instant expressive responses via an LCD screen and speaker. It’s the perfect foundation for building your own Mario levels.\n\nProduct Details:\n\nSet Number: 71403.\n\nPiece Count: 354 pieces.\n\nInteractive Figure: Includes LEGO Peach with Bluetooth connectivity for team-up play with LEGO Mario or LEGO Luigi (sold separately).\n\nIncluded Characters: Features Lemmy, a Yellow Toad, and a Lava Bubble.\n\nFeatures: Collect digital coins for helping Peach play on the swing set and for interactions with the Yellow Toad.\n\nCondition: Brand new in original factory packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Princess Peach, Starter Course, Nintendo, Building Set, Interactive Toy, LEGO 71403, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Princess Peach, Starter Course, Nintendo, Building Set, Interactive Toy, LEGO 71403, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "2 - $75ea\n2 - $52ea\napparently 4 total, currently only selling 1",
      "status": "Active",
      "id": 1023,
      "photos": []
    },
    {
      "uuid": "fddfccd3-76d6-42b7-b343-f9053ef0ad5b",
      "title": "LEGO Jurassic World 75940 Gallimimus and Pteranodon Breakout - Brand New",
      "price": 100,
      "cost": 53.2,
      "description": "Recreate epic dinosaur chases with the LEGO Jurassic World Gallimimus and Pteranodon Breakout (75940). This set includes a high-tech research vehicle equipped with a net shooter and drones to help capture the escaped dinosaurs.\n\nProduct Details:\n\nSet Number: 75940.\n\nPiece Count: 391 pieces.\n\nIncluded Dinosaurs: Features large Gallimimus and Pteranodon figures.\n\nMinifigures: Includes 3 minifigures: Owen Grady, Claire Dearing, and an ACU Trooper.\n\nVehicle Features: The research vehicle features a dual minifigure cockpit, 2 detachable drones, and a fold-out lab.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Jurassic World, Dinosaur, Gallimimus, Pteranodon, Owen Grady, Claire Dearing, LEGO 75940, Building Set, Toy Car, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Jurassic World, Dinosaur, Gallimimus, Pteranodon, Owen Grady, Claire Dearing, LEGO 75940, Building Set, Toy Car, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "Retails $70",
      "status": "Active",
      "id": 1024,
      "photos": []
    },
    {
      "uuid": "10fa3fb9-ee0f-4c0f-a8b6-af45893b3407",
      "title": "LEGO 76164 Iron Man Hulkbuster Mech Set - 456 Pieces - Factory Sealed",
      "price": 75,
      "cost": 50,
      "description": "Experience high-octane superhero action with the LEGO Marvel Avengers Iron Man Hulkbuster versus A.I.M. Agent (76164). This posable mech features a cockpit for a minifigure and a detachable shooter turret, perfect for recreating favorite movie moments.\n\nProduct Details:\n\nSet Number: 76164.\n\nPiece Count: 456 pieces.\n\nMinifigures: Includes 4 figures: Iron Man, Rescue (Pepper Potts), and two A.I.M. Agent soldiers with jetpacks and a power blaster.\n\nFeatures: Posable limbs on the Hulkbuster mech, an opening cockpit, and a cool shooter turret.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Marvel, Avengers, Iron Man, Hulkbuster, Rescue, Pepper Potts, AIM Agent, Superhero, Building Set, LEGO 76164, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Marvel, Avengers, Iron Man, Hulkbuster, Rescue, Pepper Potts, AIM Agent, Superhero, Building Set, LEGO 76164, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "",
      "status": "Sold",
      "id": 1025,
      "soldPrice": 70,
      "photos": []
    },
    {
      "uuid": "2d58d825-8df9-4740-ae0e-46ec156713dc",
      "title": "LEGO DC Batman Joker's Trike Chase 76159 - Brand New Sealed",
      "price": 75,
      "cost": 53.2,
      "description": "Put Batman action into the hands of young superheroes with the LEGO DC Batman Joker's Trike Chase (76159). This set features iconic vehicles and favorite characters for an epic battle between Batman and the Joker.\n\nProduct Details:\n\nSet Number: 76159.\n\nPiece Count: 440 pieces.\n\nMinifigures: Includes 4 figures: Batman, Robin, The Joker, and Harley Quinn.\n\nVehicles: Includes the monster-style Joker’s trike with a mouth that opens and closes, and the sleek Batmobile with an opening cockpit and removable engine.\n\nFeatures: The Batmobile engine can be used to \"turbo-charge\" the trike.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, DC, Batman, The Joker, Harley Quinn, Robin, Batmobile, Gotham City, Superheroes, Building Set, LEGO 76159, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, DC, Batman, The Joker, Harley Quinn, Robin, Batmobile, Gotham City, Superheroes, Building Set, LEGO 76159, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "Retails $69.99",
      "status": "Active",
      "id": 1026,
      "photos": []
    },
    {
      "uuid": "69ebd475-5a38-4d45-ad75-d9e058ae508e",
      "title": "LEGO Marvel Avengers Truck Take-down 76143 - Retired Set - New",
      "price": 60,
      "cost": 40,
      "description": "Recreate high-speed action from the Marvel universe with the LEGO Avengers Truck Take-down (76143). This action-packed set features an ambush on the Avengers truck by A.I.M. Agents, complete with a hidden weapon surprise.\n\nProduct Details:\n\nSet Number: 76143.\n\nPiece Count: 477 pieces.\n\nMinifigures: Includes 4 figures: Captain America, Hawkeye, and two A.I.M. Agents with jetpacks.\n\nSpecial Features: The truck features a secret lever that reveals a huge 6-shot crossbow.\n\nAdditional Vehicles: Comes with an A.I.M. Agent motor-trike and an armed drone.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Marvel, Avengers, Captain America, Hawkeye, AIM Agent, Superhero, Building Set, LEGO 76143, Retired LEGO, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Marvel, Avengers, Captain America, Hawkeye, AIM Agent, Superhero, Building Set, LEGO 76143, Retired LEGO, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "Retails $50\npaid $40",
      "status": "Active",
      "id": 1027,
      "photos": []
    },
    {
      "uuid": "492539d0-31e4-4fce-b8c8-aab5420dc408",
      "title": "LEGO Marvel Avengers Iron Man Hall of Armor 76125 - Brand New",
      "price": 100,
      "cost": 60,
      "description": "Build and customize Tony Stark’s high-tech laboratory with the LEGO Marvel Avengers Iron Man Hall of Armor (76125). This modular set can be configured in many different ways, making it the perfect display piece for any Marvel collector.\n\nProduct Details:\n\nSet Number: 76125.\n\nPiece Count: 524 pieces.\n\nMinifigures: Includes 6 Marvel Universe minifigures: Iron Man MK 1, Iron Man MK 5, Iron Man MK 41, Iron Man MK 50, and two Outriders.\n\nFeatures: Includes a rotating podium with 2 posable robotic arms, a desk, kitchen, weapon storage, and a large posable Igor suit mech with a minifigure cockpit.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Marvel, Avengers, Iron Man, Tony Stark, Hall of Armor, Igor Mech, Superheroes, Building Set, LEGO 76125, Gift Idea, Kids Toys, Collectible LEGO, MCU\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Marvel, Avengers, Iron Man, Tony Stark, Hall of Armor, Igor Mech, Superheroes, Building Set, LEGO 76125, Gift Idea, Kids Toys, Collectible LEGO, MCU",
      "location": "",
      "notes": "Retails $80\npaid $60",
      "status": "Active",
      "id": 1028,
      "photos": []
    },
    {
      "uuid": "dfb60e17-f86f-4fca-bc31-2e1c2664ac7c",
      "title": "LEGO Ninjago Zane's Mino Creature 71719 - Brand New Sealed",
      "price": 85,
      "cost": 10,
      "description": "Experience the excitement of the Shintaro dungeons with LEGO Ninjago Zane's Mino Creature (71719). This set doubles as an exciting LEGO board game, featuring a dice spinner and a track for the ninjas to navigate as they battle the Ginkle and Gleck.\n\nProduct Details:\n\nSet Number: 71719\n\nPiece Count: 616 pieces\n\nMinifigures: Includes 4 buildable figures: Hero Zane, Hero Cole, and the Geckles Ginkle and Gleck.\n\nFeatures: Build the large, posable Mino creature with a disc shooter and the fort section with a dice spinner for the board game element.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Ninjago, Zane, Cole, Mino Creature, Shintaro, Board Game, Ninja, Geckles, Building Set, LEGO 71719, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Ninjago, Zane, Cole, Mino Creature, Shintaro, Board Game, Ninja, Geckles, Building Set, LEGO 71719, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1029,
      "photos": []
    },
    {
      "uuid": "8548f28d-8f43-4ddd-87a3-fd3651292c0e",
      "title": "LEGO Ninjago OverBorg Attack 70722 - Retired Set - Brand New",
      "price": 125,
      "cost": 19.32,
      "description": "Gear up for an epic chase with the LEGO Ninjago OverBorg Attack (70722). This set pits Lloyd Garmadon and his green ninja cycle against the formidable OverBorg, who has been transformed into a half-robot, half-tank mechanical menace.\n\nProduct Details:\n\nSet Number: 70722\n\nPiece Count: 207 pieces\n\nMinifigures: Includes 2 minifigures with weapons and accessories: Lloyd (Green Ninja) and OverBorg.\n\nVehicles: Features the Green Ninja cycle with gold blades and OverBorg’s all-terrain tank bike with a rotating saw blade, mechanical chair, and flick missiles.\n\nAction Features: Includes the \"Techno-Blade\" for Lloyd and a trash can with a surprise hidden inside.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Ninjago, Lloyd, Green Ninja, OverBorg, Techno-Blade, Ninja Cycle, Tank Bike, Building Set, LEGO 70722, Retired LEGO, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Ninjago, Lloyd, Green Ninja, OverBorg, Techno-Blade, Ninja Cycle, Tank Bike, Building Set, LEGO 70722, Retired LEGO, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "Retails $25",
      "status": "Active",
      "id": 1030,
      "photos": []
    },
    {
      "uuid": "92d824cf-85f4-4929-b183-66772b7dce04",
      "title": "LEGO Creator 3-in-1 Race Car Transporter 31113 - Brand New Sealed",
      "price": 40,
      "cost": 19,
      "description": "Fuel a child's passion for vehicles with the LEGO Creator 3-in-1 Race Car Transporter (31113). This set provides three different build-and-play experiences, featuring a truck with a detachable trailer carrying two fast cars that can be loaded up the ramp.\n\nProduct Details:\n\nSet Number: 31113.\n\nPiece Count: 328 pieces.\n\n3-in-1 Model: Rebuild the car transporter into a powerful toy crane truck or a mini tugboat with a crane.\n\nTransporter Features: Includes a detachable trailer with a ramp to load and unload the two included race cars (one blue and one red).\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Creator, 3-in-1, Race Car Transporter, Crane Truck, Tugboat, Toy Cars, Building Set, LEGO 31113, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Creator, 3-in-1, Race Car Transporter, Crane Truck, Tugboat, Toy Cars, Building Set, LEGO 31113, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "Retails $24",
      "status": "Active",
      "id": 1031,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO 40700 Winter Holiday Train Seasonal GWP BNIB (Copy)",
      "price": 25,
      "cost": 0,
      "description": "LEGO 40700 Winter Holiday Train (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set, available during the 2024 holiday period.\n\nThe model features a steam locomotive with two detachable carriages.\n\nThe carriages carry wrapped presents and a Christmas tree that can spin around.\n\nThe set contains 294 pieces.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40700, Winter Holiday Train, Seasonal, Christmas, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty :3 sold 3, \nRETAIL $25\nKat - ?\nChristine?\nCarrie - \nMegan - sold\nSabrina?",
      "status": "Sold",
      "listings_backup": [
        {
          "itemId": 920,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/2414821018962015",
          "date": "2025-12-16T06:58:05.200Z",
          "id": 97
        }
      ],
      "uuid": "18d3a2cc-fe98-425b-b485-c79b45243d07",
      "id": 1033,
      "soldPrice": 25,
      "photos": []
    },
    {
      "title": "RARE RETIRED LEGO 40516 Everyone is Awesome Exclusive Set BNIB (Copy)",
      "price": 60,
      "cost": 50,
      "description": "LEGO 40516 Everyone is Awesome (BNIB)\n\nRETIRED / DISCONTINUED EXCLUSIVE SET\n\nA unique rainbow display model featuring 11 monochromatic minifigures.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nPieces: 346 pieces. A popular collector's piece.\n\nSearch Tags: 40516, Everyone is Awesome, Rainbow, Exclusive, Retired, BNIB, Display, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40516, Everyone is Awesome, Rainbow, Exclusive, Retired, BNIB, Display, LEGO",
      "location": "",
      "notes": "Qty: 2\nRetail is $50.40, I paid $22.50 for two of them.",
      "status": "Sold",
      "listings_backup": [
        {
          "itemId": 911,
          "platform": "Facebook",
          "url": "https://www.facebook.com/marketplace/item/1219495340055423",
          "date": "2025-12-15T08:08:26.088Z",
          "id": 88
        }
      ],
      "uuid": "54564e37-a751-4371-ad71-8cdc12aa22d9",
      "id": 1034,
      "soldPrice": 60,
      "photos": []
    },
    {
      "uuid": "df42cd99-22ba-47b3-b315-fdb3d98b0443",
      "title": "RARE RETIRED LEGO 40484 Santa's Front Yard Winter Seasonal GWP BNIB (Copy)",
      "price": 25,
      "cost": 0,
      "description": "LEGO 40484 Santa's Front Yard (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set released in November 2021 with a high spending threshold.\n\nThe set contains 317 pieces and includes a buildable reindeer figure and an elf minifigure.\n\nIt depicts a charming icy, moonlit setting in Santa's front yard with a snow-covered North Pole sign and trees.\n\nThe elf is shown feeding the reindeer a carrot by a clear stream.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "Qty: 4\nRETAIL $27 PAID ZERO FOR ALL",
      "status": "Sold",
      "id": 1035,
      "soldPrice": 25,
      "photos": []
    },
    {
      "uuid": "984e00a1-78e4-4111-aa4f-cf6752cf065a",
      "title": "LEGO Hidden Side The Lighthouse of Darkness 70431 - Brand New",
      "price": 85,
      "cost": 62,
      "soldPrice": 0,
      "description": "Immerse yourself in an amazing single or multiplayer augmented reality (AR) experience with the LEGO Hidden Side The Lighthouse of Darkness (70431). This set combines the open creative play of LEGO building toys with a digital app for an interactive ghost-hunting adventure.\n\nProduct Details:\n\nSet Number: 70431.\n\nPiece Count: 540 pieces.\n\nMinifigures: Includes 5 minifigures: Jack, Parker, Skeleton, Jennie Napo, and Claus Stormward.\n\nInteractive Play: Download the Hidden Side AR app and point your smart device at the model to reveal a digital world of ghosts, mysteries, and boss ghost Joe Ishmael.\n\nFeatures: A detailed lighthouse with a rocky cliff, steps, and a jetty, plus a cool jet ski for the heroes.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Lighthouse, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70431, Superheroes, Building Set, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Lighthouse, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70431, Superheroes, Building Set, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1036,
      "photos": []
    },
    {
      "uuid": "c7504842-ac82-4b85-a703-5d78f5c0dd58",
      "title": "LEGO Hidden Side Shrimp Shack Attack 70422 - Brand New & Sealed",
      "price": 80,
      "cost": 62,
      "soldPrice": 0,
      "description": "Combine physical building with digital adventure in the LEGO Hidden Side Shrimp Shack Attack (70422). This set allows you to build a detailed diner and then use the Hidden Side app to hunt ghosts and solve mysteries in a haunted augmented reality world.\n\nProduct Details:\n\nSet Number: 70422.\n\nPiece Count: 579 pieces.\n\nMinifigures: Includes 5 figures: Jack Davids, Parker L. Jackson, Chef Enzo, Sally, and Ronny, plus Jack's ghost dog figure, Spencer.\n\nInteractive Play: Point your phone at the set to make it come alive in the app, revealing a \"Hidden Side\" full of ghosts and boss ghost Anomalo.\n\nFeatures: A high-tech go-kart for the heroes and a detailed Shrimp Shack kitchen with a \"haunted\" sign that flips.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Shrimp Shack, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70422, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Shrimp Shack, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70422, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1037,
      "photos": []
    },
    {
      "uuid": "3bf14f96-d90a-4cf1-b802-da72455bba89",
      "title": "LEGO Hidden Side Ghost Train Express 70424 - Brand New & Sealed",
      "price": 120,
      "cost": 88,
      "soldPrice": 0,
      "description": "Step into a world of haunted locomotives with the LEGO Hidden Side Ghost Train Express (70424). This set delivers a unique building experience combined with augmented reality (AR) technology, allowing you to reveal a digital world of ghosts and mysteries through the Hidden Side app.\n\nProduct Details:\n\nSet Number: 70424\n\nPiece Count: 698 pieces\n\nMinifigures: Includes 5 figures: Jack Davids, Parker L. Jackson, tech genius J.B., ticket agent Ms. Santos, and Chuck the friendly commuter.\n\nInteractive Play: The train and station models come to life when viewed through the AR app, featuring ghost boss The Bawa to defeat.\n\nFeatures: Features \"ghost wings\" that fold out with the flick of a lever, a haunted station with a ticket booth, and hidden details throughout the train.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Ghost Train, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70424, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Haunted Train\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Ghost Train, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70424, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Haunted Train",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1038,
      "photos": []
    },
    {
      "uuid": "2947590b-0f9b-4d76-b9ed-f2ca45d5566e",
      "title": "LEGO Hidden Side Phantom Fire Truck 3000 (70436) - Brand New & Sealed",
      "price": 120,
      "cost": 72,
      "soldPrice": 0,
      "description": "Engage in a thrilling paranormal battle with the LEGO Hidden Side Phantom Fire Truck 3000 (70436). This set combines the creative fun of a LEGO building toy with a digital app to create a solo or multiplayer augmented reality experience.\n\nProduct Details:\n\nSet Number: 70436.\n\nPiece Count: 760 pieces.\n\nMinifigures: Includes 5 figures: Jack, Parker, J.B., TeeVee, and a Shadow-Walker, plus a Nehmaar Reem (The Harbinger) figure.\n\nInteractive Play: The model reveals a haunted digital world when viewed through a smart device equipped with the Hidden Side AR app.\n\nSpecial Features: The fire truck features a detachable mech robot, \"ghost\" wings that fold out, and a rear-mounted water cannon.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Phantom Fire Truck, Fire Truck, Mech, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70436, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Phantom Fire Truck, Fire Truck, Mech, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70436, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1039,
      "photos": []
    },
    {
      "uuid": "88b1784a-3bcd-485d-8f06-8d7348b65332",
      "title": "LEGO Hidden Side Newbury Juice Bar 40336 - Brand New & Sealed",
      "price": 25,
      "cost": 2.46,
      "soldPrice": 0,
      "description": "Experience the spooky side of Newbury with the LEGO Hidden Side Newbury Juice Bar (40336). This set allows you to build a standard juice bar that \"transforms\" into a haunted location, compatible with the Hidden Side AR app for a digital ghost-hunting experience.\n\nProduct Details:\n\nSet Number: 40336.\n\nPiece Count: 127 pieces.\n\nMinifigures: Includes 2 figures: Parker L. Jackson and Rocky the juice bar worker (with an interchangeable ghost head).\n\nInteractive Play: Use the Hidden Side app to find and defeat ghosts in a digital world by interacting with the physical model.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Newbury Juice Bar, Ghost Hunting, Augmented Reality, AR Toy, LEGO 40336, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Newbury Juice Bar, Ghost Hunting, Augmented Reality, AR Toy, LEGO 40336, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1040,
      "photos": []
    },
    {
      "uuid": "cb217d02-18cc-4e30-9d37-5882531ca61d",
      "title": "LEGO Hidden Side El Fuego's Stunt Plane 70429 - Retired - Brand New",
      "price": 50,
      "cost": 35,
      "soldPrice": 0,
      "description": "Take to the skies with the LEGO Hidden Side El Fuego's Stunt Plane (70429). This 2020 retired set offers a unique 2-in-1 experience, combining classic LEGO building with an interactive augmented reality (AR) app to hunt ghosts in the fictional town of Newbury.\n\nProduct Details:\n\nSet Number: 70429.\n\nPiece Count: 295 pieces.\n\nMinifigures: Includes 3 figures: Jack Davids, skeleton El Fuego, and Mary Breaksom, plus a Spencer the ghost dog figure.\n\nInteractive Play: Viewing the stunt plane through the free Hidden Side AR app reveals a haunted digital world where you can solve mysteries and battle boss ghost Harry Cane.\n\nPlane Features: A classic propeller biplane with stud launchers and a broad fuselage for high-performance \"stunt\" play.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, El Fuego, Stunt Plane, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70429, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Biplane\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, El Fuego, Stunt Plane, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70429, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Biplane",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1041,
      "photos": []
    },
    {
      "uuid": "663da2b4-b13c-4a4a-829f-bb90f152923a",
      "title": "LEGO Hidden Side Supernatural Race Car 70434 - Retired - Brand New",
      "price": 85,
      "cost": 35,
      "soldPrice": 0,
      "description": "Get ready for an action-packed paranormal chase with the LEGO Hidden Side Supernatural Race Car (70434). This 2020 retired set offers a unique 2-in-1 experience, combining classic LEGO building with an interactive augmented reality (AR) app to hunt ghosts in the fictional town of Newbury.\n\nProduct Details:\n\nSet Number: 70434.\n\nPiece Count: 244 pieces.\n\nMinifigures: Includes 3 figures: Jack Davids, Vaughn Geist, and a Shadow-Walker, plus a Spencer the ghost dog figure.\n\nInteractive Play: Viewing the race car through the free Hidden Side AR app reveals a haunted digital world where you can solve mysteries and battle boss ghosts.\n\nRace Car Features: A detailed, supernatural-themed vehicle designed for high-speed play and display.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Supernatural Race Car, Race Car, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70434, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Supernatural Race Car, Race Car, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70434, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1042,
      "photos": []
    },
    {
      "uuid": "3208bd83-d725-4a2f-b75e-b85f69025abf",
      "title": "LEGO Hidden Side Jack's Beach Buggy 70428 - Retired Set - Brand New",
      "price": 35,
      "cost": 22,
      "soldPrice": 0,
      "description": "Experience a unique blend of physical and digital play with LEGO Hidden Side Jack's Beach Buggy (70428). This 2020 retired set allows you to build a rugged beach buggy that comes to life when viewed through the Hidden Side augmented reality (AR) app.\n\nProduct Details:\n\nSet Number: 70428.\n\nPiece Count: 170 pieces.\n\nMinifigures: Includes 3 figures: Jack Davids, Parker L. Jackson, and a possessed mechanic, Scott Francis.\n\nInteractive Play: Use the free AR app to explore a haunted digital world, solve mysteries, and battle the powerful boss ghost Trucker Dale.\n\nVehicle Features: The buggy features an elevated chassis, enormous tires for uneven terrain, and a notable suspension mechanism.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Jack's Beach Buggy, Dune Buggy, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70428, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Jack's Beach Buggy, Dune Buggy, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70428, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1043,
      "photos": []
    },
    {
      "uuid": "bd959dbc-ec15-4085-822e-7342aff63573",
      "title": "LEGO Hidden Side J.B.'s Ghost Lab 70418 - Retired Set - Brand New",
      "price": 40,
      "cost": 22,
      "soldPrice": 0,
      "description": "Experience a unique blend of physical and digital play with LEGO Hidden Side J.B.'s Ghost Lab (70418). This retired set allows builders to explore a mad scientist-inspired lab that comes to life when viewed through the Hidden Side augmented reality (AR) app.\n\nProduct Details:\n\nSet Number: 70418.\n\nPiece Count: 174 pieces.\n\nMinifigures: Includes 3 figures: Jack Davids, the scientist J.B., and the janitor Douglas Elton, plus Jack's ghost dog, Spencer.\n\nInteractive Play: Point a smart device at the lab to find and capture ghosts, solve mysteries, and battle the boss ghost, Mr. Drewell (or Bobo in the app).\n\nLab Features: Includes a \"Tesla-powered\" de-haunting chamber, a 3D printer, a computer console, and a color wheel that interacts directly with the mini-game in the app.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, J.B.'s Ghost Lab, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70418, Mad Scientist, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, J.B.'s Ghost Lab, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70418, Mad Scientist, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1044,
      "photos": []
    },
    {
      "uuid": "5498ddbb-25b1-4be5-94f6-2df54e797ff5",
      "title": "LEGO Hidden Side Paranormal Intercept Bus 3000 (70423) - Retired - New",
      "price": 100,
      "cost": 71,
      "soldPrice": 0,
      "description": "Experience a unique blend of physical and digital play with the LEGO Hidden Side Paranormal Intercept Bus 3000 (70423). This 2019 retired set allows you to build a detailed school bus that comes to life with ghosts and mysteries when viewed through the Hidden Side augmented reality (AR) app.\n\nProduct Details:\n\nSet Number: 70423.\n\nPiece Count: 689 pieces.\n\nMinifigures: Includes 6 figures: heroes Jack Davids and Parker L. Jackson (each with a smartphone), tech genius J.B., haunted workers Nanna and Bill, and Spencer the ghost dog figure.\n\nInteractive Play: Use the free AR app to explore an ever-changing environment, solve mysteries, and defeat unique ghost bosses like Spewer.\n\nBus Features: Includes a pull-out command station, flip-out \"de-haunting\" cannons, rooftop scanners, and a portable toilet that transforms into a brown-tile-spitting ghost monster.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Paranormal Intercept Bus 3000, School Bus, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70423, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Paranormal Intercept Bus 3000, School Bus, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70423, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1045,
      "photos": []
    },
    {
      "uuid": "444faf95-f50b-4808-89a0-fcf0a1b8dfdf",
      "title": "LEGO Hidden Side J.B.'s Submarine 70433 - Retired Set - Brand New",
      "price": 50,
      "cost": 22,
      "soldPrice": 0,
      "description": "Dive into a haunted deep-sea world with LEGO Hidden Side J.B.'s Submarine (70433). This retired 2020 set offers a mixed-reality experience by combining physical building with an interactive augmented reality (AR) app.\n\nProduct Details:\n\nSet Number: 70433.\n\nPiece Count: 224 pieces.\n\nMinifigures: Includes 3 figures: Parker, Vaughn Geist, and the Statue of Evil, plus a shark figure.\n\nInteractive Play: Viewing the model through the free Hidden Side AR app reveals a digital world where kids can hunt ghosts, solve mysteries, and battle boss ghost Kreatoru.\n\nModel Dimensions: When built, the submarine measures over 8\" (21cm) high, 7\" (19cm) long, and 3\" (10cm) wide.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, J.B.'s Submarine, Submarine, Shark, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70433, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, J.B.'s Submarine, Submarine, Shark, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70433, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1046,
      "photos": []
    },
    {
      "uuid": "1d01b123-92cc-435c-99a7-bc78ff6698f3",
      "title": "LEGO 70427 Welcome to the Hidden Side - 189 Pieces - AR Interactive - Sealed",
      "price": 50,
      "cost": 22,
      "soldPrice": 0,
      "description": "Explore the mysteries of Newbury with LEGO Welcome to the Hidden Side (70427). This retired set from 2020 features a \"haunted-tree\" model designed for both creative physical play and an immersive digital experience through the free Hidden Side AR app.\n\nProduct Details:\n\nSet Number: 70427.\n\nPiece Count: 189 pieces.\n\nMinifigures: Includes 4 unique minifigures: hero Jack Davids and possessed characters Axel Chops, Scrimper, and Waylon.\n\nInteractive Play: Scan the model with the AR app to hunt ghosts, solve mysteries, and battle the boss ghost Lady E.\n\nModel Dimensions: When built, the haunted-tree measures over 6\" (17cm) high, 8\" (22cm) wide, and 5\" (13cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Welcome to the Hidden Side, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70427, Haunted Tree, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Welcome to the Hidden Side, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70427, Haunted Tree, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1047,
      "photos": []
    },
    {
      "uuid": "2151085f-6e3c-4925-8edc-07877d18adaa",
      "title": "LEGO Hidden Side Haunted Fairground 70432 - Retired Set - Brand New",
      "price": 80,
      "cost": 62,
      "soldPrice": 0,
      "description": "Step into a world of \"ice screams\" and ghostly thrills with LEGO Hidden Side Haunted Fairground (70432). This 2020 retired set offers an immersive augmented reality (AR) experience, allowing you to bring the fairground to life through a free digital app.\n\nProduct Details:\n\nSet Number: 70432.\n\nPiece Count: 466 pieces.\n\nMinifigures: Includes 5 figures: Jack, Parker, J.B., and exclusive clowns Jimbo Loblo and Terry Top.\n\nInteractive Play: Viewing the model through the Hidden Side AR app reveals a digital world where kids can solve mysteries, hunt ghosts, and battle the boss ghost, Tragico the Clown.\n\nFairground Features: Includes a buildable roller coaster with a carriage, a vertical drop ride that triggers a transforming face, and a detailed ticket booth.\n\nDimensions: When built, the model measures over 11\" (28cm) high, 13\" (35cm) wide, and 10\" (27cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Haunted Fairground, Roller Coaster, Amusement Park, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70432, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Haunted Fairground, Roller Coaster, Amusement Park, Ghost Hunting, Augmented Reality, AR Toy, LEGO 70432, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1048,
      "photos": []
    },
    {
      "uuid": "f67a9971-db8f-40b1-80f3-bb1915a73576",
      "title": "LEGO Hidden Side Drag Racer 40408 - Retired Promotional Set - New",
      "price": 25,
      "cost": 2.46,
      "soldPrice": 0,
      "description": "Experience the thrill of a haunted race with the LEGO Hidden Side Drag Racer (40408). Originally released in 2020 as a limited \"Gift with Purchase,\" this retired set allows you to reveal a digital world of ghosts by scanning the model with the Hidden Side augmented reality (AR) app.\n\nProduct Details:\n\nSet Number: 40408.\n\nPiece Count: 134 pieces.\n\nMinifigures: Includes 2 figures: hero Jack Davids (in a white hoodie) and a \"possessed\" Biker Dwayne.\n\nAction Features: The drag racer features a rear-mounted cannon for launching minifigures and two folding side sections that open to reveal spooky, glowing eyes.\n\nAR Interaction: Use your smart device and the Hidden Side app to hunt for ghosts hidden within the set's characters.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Hidden Side, Drag Racer, Race Car, Ghost Hunting, Augmented Reality, AR Toy, LEGO 40408, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Promotional Set\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Hidden Side, Drag Racer, Race Car, Ghost Hunting, Augmented Reality, AR Toy, LEGO 40408, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Promotional Set",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1049,
      "photos": []
    },
    {
      "uuid": "1d66e2a5-b436-423c-afc9-a164ce46bc43",
      "title": "LEGO Super Mario Big Urchin Beach Ride 71400 - Expansion Set - New",
      "price": 125,
      "cost": 89.6,
      "soldPrice": 0,
      "description": "Level up your starter course with the LEGO Super Mario Big Urchin Beach Ride (71400). This expansion set features a roller-coaster-style track with a dolphin for LEGO Mario or Luigi (figures not included) to ride on while trying to shake the Super Star Block out of the palm tree and topple the Big Urchin.\n\nProduct Details:\n\nSet Number: 71400.\n\nPiece Count: 536 pieces.\n\nInteractive Figures: Features a Big Urchin, 2 Cheep Cheeps, a Dolphin, and a Yellow Yoshi.\n\nKey Features: Includes a springboard for diving and a roller-coaster-style track to earn digital coins.\n\nExpansion Required: To enjoy the full interactive experience, this set requires the LEGO Super Mario (71360) or LEGO Luigi (71387) Starter Course.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Big Urchin, Expansion Set, LEGO 71400, Yoshi, Cheep Cheep, Building Set, Gift Idea, Kids Toys, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Big Urchin, Expansion Set, LEGO 71400, Yoshi, Cheep Cheep, Building Set, Gift Idea, Kids Toys, Collectible LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1050,
      "photos": []
    },
    {
      "uuid": "49246828-d3ff-46b0-a2f0-6c9811b1b739",
      "title": "LEGO Super Mario Master Your Adventure Maker Set 71380 - Brand New",
      "price": 100,
      "cost": 78.4,
      "soldPrice": 0,
      "description": "Unlock your creativity with the LEGO Super Mario Master Your Adventure Maker Set (71380). This versatile set features a Customization Machine that lets you program the rewards in the included Time Block and Item Blocks, allowing you to choose between power-ups like a Super Mushroom or even a Poison Mushroom.\n\nProduct Details:\n\nSet Number: 71380.\n\nPiece Count: 366 pieces.\n\nInteractive Figures: Includes 4 iconic enemy characters: Larry Koopa, a Goomba, a Bob-omb, and a Koopa Paratroopa.\n\nKey Features: Includes the Special Pipe: Dash 30, which challenges players to complete a custom level in just 30 seconds for extra digital coins.\n\nCustomization: Use the Maker machine and colored LEGO elements to trigger different digital reactions in your LEGO Mario or Luigi figures.\n\nCompatibility: Requires a LEGO Super Mario Starter Course (71360, 71387, or 71403) for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Larry Koopa, Mario Maker, Expansion Set, LEGO 71380, Goomba, Bob-omb, Building Set, Gift Idea, Kids Toys, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Larry Koopa, Mario Maker, Expansion Set, LEGO 71380, Goomba, Bob-omb, Building Set, Gift Idea, Kids Toys, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1051,
      "photos": []
    },
    {
      "uuid": "7533f2ab-9a2e-4d75-93d3-7d39529e06dc",
      "title": "LEGO Super Mario Toad’s Special Hideaway 77907 - Rare SDCC Exclusive - New",
      "price": 150,
      "cost": 100,
      "soldPrice": 0,
      "description": "Add a rare piece of the Mushroom Kingdom to your collection with LEGO Super Mario Toad’s Special Hideaway (77907). This retired \"Special Limited Edition\" expansion set features a buildable Toad House and was produced as a 2020 event exclusive, making it highly sought after by collectors.\n\nProduct Details:\n\nSet Number: 77907.\n\nPiece Count: 120 pieces.\n\nInteractive Figures: Includes a brick-built Toad figure that interactive LEGO Mario or Luigi figures can greet.\n\nKey Features: Features a buildable house from Toad Village, a tree, a sign, and a unique ? Block that offers different digital rewards.\n\nSpecial Element: This set includes a rare fence element not commonly found in other Super Mario sets.\n\nCompatibility: Requires a LEGO Super Mario Starter Course (71360 or 71387) for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed \"Special Limited Edition\" packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Toad, Toad Village, Expansion Set, LEGO 77907, Rare LEGO, SDCC Exclusive, Comic-Con, Limited Edition, Retired LEGO, Gift Idea, Collectible LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Toad, Toad Village, Expansion Set, LEGO 77907, Rare LEGO, SDCC Exclusive, Comic-Con, Limited Edition, Retired LEGO, Gift Idea, Collectible LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1052,
      "photos": []
    },
    {
      "uuid": "beddc4ed-a121-4cdd-bf3c-819f673aecdf",
      "title": "LEGO Super Mario Lakitu Sky World 71389 - Retired - Brand New Sealed",
      "price": 75,
      "cost": 56,
      "soldPrice": 0,
      "description": "Add a \"digital-coin-winning\" challenge to your Mushroom Kingdom with the LEGO Super Mario Lakitu Sky World (71389). This retired set features a spinning cloud platform that players must rotate by sliding LEGO Mario or Luigi (figures not included) back and forth on cloud sliders to knock Lakitu off his perch.\n\nProduct Details:\n\nSet Number: 71389\n\nPiece Count: 484 pieces\n\nInteractive Figures: Includes 3 iconic enemy characters: Lakitu (on a buildable cloud), a Bullet Bill, and a Fuzzy.\n\nKey Features: Features a spinning cloud platform and a Time Block that offers players extra time to complete their custom levels.\n\nSocial Play: Designed for solo play or social fun; connect two interactive figures via Bluetooth to earn bonus coins through teamwork.\n\nCompatibility: Requires a LEGO Super Mario Starter Course (71360 or 71387) for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Lakitu, Bullet Bill, Expansion Set, LEGO 71389, Fuzzy, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Lakitu, Bullet Bill, Expansion Set, LEGO 71389, Fuzzy, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1053,
      "photos": []
    },
    {
      "uuid": "59b40fa1-cd6f-48af-b59f-dbd75e832497",
      "title": "LEGO Super Mario Chain Chomp Jungle Encounter 71381 - Retired - New",
      "price": 60,
      "cost": 28,
      "soldPrice": 0,
      "description": "Add a leaping challenge to your Mushroom Kingdom with the LEGO Super Mario Chain Chomp Jungle Encounter (71381). This retired expansion set features a jumping platform used to knock a Chain Chomp out of the way, revealing a hidden Coin Block for digital rewards.\n\nProduct Details:\n\nSet Number: 71381.\n\nPiece Count: 160 pieces.\n\nInteractive Figures: Includes figures of 2 iconic enemies: a Chain Chomp and a Bramball.\n\nGameplay Features: Includes a jumping platform to defeat enemies and a Coin Block that offers extra digital coin rewards to the player.\n\nSoda Jungle Biome: Features purple elements representing a poisonous swamp environment.\n\nCompatibility: Requires a LEGO Super Mario Starter Course (71360 or 71387) for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Chain Chomp, Bramball, Expansion Set, LEGO 71381, Soda Jungle, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Chain Chomp, Bramball, Expansion Set, LEGO 71381, Soda Jungle, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1054,
      "photos": []
    },
    {
      "uuid": "b0127b8b-8253-49ad-9ebc-be7968bf0642",
      "title": "LEGO Super Mario Boss Sumo Bro Topple Tower 71388 - Retired - New",
      "price": 60,
      "cost": 44.8,
      "soldPrice": 0,
      "description": "Expand your Mushroom Kingdom with the LEGO Super Mario Boss Sumo Bro Topple Tower (71388). This retired expansion set features a buildable tower that players must \"rock\" by having an interactive LEGO Mario or Luigi figure stomp on the levers at the base.\n\nProduct Details:\n\nSet Number: 71388.\n\nPiece Count: 231 pieces.\n\nInteractive Figures: Includes 2 iconic enemy characters: a Boss Sumo Bro (with chest-thumping arms) and a Crowber.\n\nGameplay Features: Rocking the tower dethrones the Boss Sumo Bro, revealing a Super Star Block for extra digital rewards.\n\nDimensions: In its basic formation, the module measures over 9\" (23cm) high, 7.5\" (20cm) wide, and 5\" (13cm) deep.\n\nTwo-Player Fun: Connect two interactive figures via Bluetooth to earn bonus coins through teamwork.\n\nCompatibility: Requires a LEGO Super Mario Starter Course (71360 or 71387) for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Boss Sumo Bro, Crowber, Expansion Set, LEGO 71388, Topple Tower, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Boss Sumo Bro, Crowber, Expansion Set, LEGO 71388, Topple Tower, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1055,
      "photos": []
    },
    {
      "uuid": "0fac0942-4f63-4872-850e-41cb24de3b83",
      "title": "LEGO Super Mario Piranha Plant Puzzling Challenge 71382 - Retired - New",
      "price": 60,
      "cost": 44.8,
      "soldPrice": 0,
      "description": "Expand your interactive adventures with the LEGO Super Mario Piranha Plant Puzzling Challenge (71382). This 2021 retired expansion set features a buildable Soda Jungle module where players must knock over two Piranha Plants to reach hidden rewards.\n\nProduct Details:\n\nSet Number: 71382.\n\nPiece Count: 267 pieces.\n\nInteractive Figures: Includes 3 iconic enemy figures: 2 Piranha Plants and a Spiny.\n\nKey Gameplay: Features a spinning carousel used to knock the Piranha Plants out of the way to reach 3 Red-Coin Blocks.\n\nSpecial Rewards: Jumping on all three Red-Coin Blocks within the time limit earns players a large digital coin bonus.\n\nDimensions: In its basic formation, the module measures over 3.5\" (9cm) high, 21\" (53cm) wide, and 6.5\" (16cm) deep.\n\nCompatibility: Requires the LEGO Super Mario (71360) or LEGO Luigi (71387) Starter Course for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Piranha Plant, Spiny, Expansion Set, LEGO 71382, Soda Jungle, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Piranha Plant, Spiny, Expansion Set, LEGO 71382, Soda Jungle, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1056,
      "photos": []
    },
    {
      "uuid": "43016866-2cba-491e-b5ae-df79926df169",
      "title": "LEGO Friends Amusement Park Roller Coaster 41130 - 1124 Pieces - Retired",
      "price": 200,
      "cost": 50,
      "soldPrice": 0,
      "description": "Experience the ultimate day out with the LEGO Friends Amusement Park Roller Coaster (41130). This highly detailed, retired set from 2016 features three major working rides and a variety of park accessories for endless creative play.\n\nProduct Details:\n\nSet Number: 41130.\n\nPiece Count: 1,124 pieces.\n\nMini-Dolls: Includes 4 figures: Emma, Andrea, Matthew, and Naya in summer outfits.\n\nMajor Rides:\n\nRoller Coaster: Features a 27-inch (71cm) track with 4 carriages and a functioning light brick in the front car.\n\nFerris Wheel: A rotating wheel with 6 hanging gondolas for the mini-dolls.\n\nDrop Tower: Features 2 cars with safety bars and an exciting spinning function as it drops.\n\nAccessories: Entrance booth with turnstile, dining area with a popcorn cart, maps, tickets, and food elements like watermelon and hot dogs.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Friends, Amusement Park, Roller Coaster, Ferris Wheel, Drop Tower, Retired LEGO, Heartlake City, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Rare LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Friends, Amusement Park, Roller Coaster, Ferris Wheel, Drop Tower, Retired LEGO, Heartlake City, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Rare LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1057,
      "photos": []
    },
    {
      "uuid": "55cec178-72d6-4246-83bc-eed446d7c85a",
      "title": "LEGO Friends Baking Competition 41393 - 361 Pieces - Retired Set - New",
      "price": 40,
      "cost": 10,
      "soldPrice": 0,
      "description": "Bring the excitement of a TV studio home with the LEGO Friends Baking Competition (41393). This 2020 set is packed with realistic kitchen tools and play food, allowing kids to role-play as contestants, judges, or even camera operators.\n\nProduct Details:\n\nSet Number: 41393.\n\nPiece Count: 361 pieces.\n\nMini-Dolls: Includes 3 figures: Stephanie, David, and Lillie (the judge).\n\nInteractive Features: Includes 2 cook stations with rotating cake stands and a spinning ingredients wheel to choose a baking theme.\n\nAccessories: Features a wealth of kitchen gear, including a trophy, a cash check, rolling pins, icing, a whisk, and various toy food items.\n\nModular Design: The set can be separated into different sections, allowing for customized play and display.\n\nDimensions: When assembled, it measures just over 5\" (15cm) high and 11\" (30cm) wide.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Friends, Baking Competition, TV Studio, Cooking Toy, Heartlake City, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Stephanie, David, Lillie\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Friends, Baking Competition, TV Studio, Cooking Toy, Heartlake City, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO, Stephanie, David, Lillie",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1058,
      "photos": []
    },
    {
      "uuid": "16893481-59f8-4036-99cd-b2933ca23e14",
      "title": "LEGO Ninjago Micro Ninjago Docks 40704 - Limited Edition - New Sealed",
      "price": 40,
      "cost": 0,
      "soldPrice": 0,
      "description": "Celebrate a decade of adventure with the LEGO Micro Ninjago Docks (40704). This limited-edition set allows you to build a downsized version of the iconic NINJAGO City Docks, featuring several identifiable locations from the original model.\n\nProduct Details:\n\nSet Number: 40704.\n\nPiece Count: 275 pieces.\n\nMicro-Scale Features: Includes miniature versions of a market, apartments, a tearoom, and an arcade.\n\nModular Compatibility: Can be connected to three other micro sets (sold separately), such as the Micro NINJAGO City (40703), to create a complete miniature cityscape.\n\nDimensions: Measures over 4 in. (10 cm) high, 2.5 in. (6 cm) wide, and 4 in. (10 cm) deep.\n\nAvailability: Originally released in 2024 as an exclusive reward for LEGO Insiders members.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Ninjago, Ninjago City, Microscale, Limited Edition, LEGO 40704, Ninja Toys, Building Set, Gift Idea, Collectible LEGO, Retired LEGO, Modular Building\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Ninjago, Ninjago City, Microscale, Limited Edition, LEGO 40704, Ninja Toys, Building Set, Gift Idea, Collectible LEGO, Retired LEGO, Modular Building",
      "location": "",
      "notes": "Retail $19",
      "status": "Active",
      "id": 1059,
      "photos": []
    },
    {
      "uuid": "4eac9aae-bf12-4768-9120-1105e4060905",
      "title": "LEGO Disney Belle's Castle Winter Celebration 43180 - Brand New Sealed",
      "price": 85,
      "cost": 15,
      "soldPrice": 0,
      "description": "Celebrate a winter wonderland with LEGO Belle's Castle Winter Celebration (43180). Released in 2020 as part of the 4+ line, this retired set features easy-to-build \"Starter Bricks\" that allow first-time builders to construct a detailed castle with pride.\n\nProduct Details:\n\nSet Number: 43180.\n\nPiece Count: 238 pieces.\n\nMini-Doll Figures: Includes Belle (in a special winter dress) and the Beast, who can be transformed into the Prince.\n\nOther Characters: Features iconic friends including Mrs. Potts, Chip, Cogsworth, Lumiere, and Wardrobe, plus bird and snowman figures.\n\nCastle Features: The colorful castle includes multiple rooms to explore, such as a bedroom, library, and a cozy fireplace area.\n\nFun Accessories: Includes an enchanted rose, a vanity table with a brush and tiara, a snowball-launching catapult, and various play-starter items.\n\nDimensions: Once built, the castle measures over 9\" (23cm) high, 9\" (25cm) wide, and 6\" (16cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Disney Princess, Belle, Beauty and the Beast, Disney Castle, LEGO 43180, Winter Celebration, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Disney Princess, Belle, Beauty and the Beast, Disney Castle, LEGO 43180, Winter Celebration, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1060,
      "photos": []
    },
    {
      "uuid": "ec92051e-fd1c-42aa-9d5f-02d7b7e8045f",
      "title": "LEGO DC Wonder Woman vs Cheetah 76157 - Retired Set - Brand New",
      "price": 55,
      "cost": 38,
      "soldPrice": 0,
      "description": "Relive epic movie moments with the LEGO DC Wonder Woman vs Cheetah (76157). This action-packed building kit features a two-sided model with a high-tech bunker and a massive transmitter tower that rotates 360 degrees and moves up and down.\n\nProduct Details:\n\nSet Number: 76157.\n\nPiece Count: 371 pieces.\n\nMinifigures: Includes 3 unique figures: Wonder Woman (Diana Prince) in her golden armor with wings and a molded helmet, her archenemy Cheetah (Dr. Barbara Minerva), and Maxwell Lord.\n\nInteractive Features: Kids can attach Wonder Woman to the rotating transmitter to \"fly\" around the tower while Max stands at the controls in the bunker below.\n\nDimensions: The model measures over 7” (19 cm) high and 6” (17 cm) wide, with a radar dish that is 7” (20 cm) across.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, DC Comics, Super Heroes, Wonder Woman, Cheetah, Maxwell Lord, WW84, Wonder Woman 1984, LEGO 76157, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, DC Comics, Super Heroes, Wonder Woman, Cheetah, Maxwell Lord, WW84, Wonder Woman 1984, LEGO 76157, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "Retails $50",
      "status": "Active",
      "id": 1061,
      "photos": []
    },
    {
      "uuid": "8557dc4c-4bb2-4e46-8627-efe2762fb12a",
      "title": "LEGO Marvel Spider-Man Molten Man Battle 76128 - Retired - New Sealed",
      "price": 75,
      "cost": 30.4,
      "soldPrice": 0,
      "description": "Join forces with Mysterio to stop a metropolis-melting disaster in LEGO Molten Man Battle (76128). This retired 2019 set features a towering, buildable Molten Man figure with \"melting\" objects like half a car, a street lamp, and a traffic light absorbed into its body.\n\nProduct Details:\n\nSet Number: 76128.\n\nPiece Count: 294 pieces.\n\nMinifigures: Includes 3 figures: Spider-Man in his exclusive black-and-grey stealth suit (\"Night Monkey\"), Mysterio with power energy elements, and a Firefighter.\n\nInteractive Features: The Molten Man figure features a posable head, arms, and legs, a 6-stud rapid shooter, and a gripping claw that can hold a minifigure.\n\nAccessories: Includes Spider-Man's web pack and a buildable fire extinguisher.\n\nDimensions: The buildable Molten Man action figure stands over 7” (18cm) tall.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Marvel, Spider-Man, Far From Home, Molten Man, Mysterio, Stealth Suit, Night Monkey, Super Heroes, LEGO 76128, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Marvel, Spider-Man, Far From Home, Molten Man, Mysterio, Stealth Suit, Night Monkey, Super Heroes, LEGO 76128, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1062,
      "photos": []
    },
    {
      "uuid": "56e554fb-ac93-41a0-9ebb-bc4643591af0",
      "title": "LEGO Harry Potter Forbidden Forest: Umbridge's Encounter 75967 - Retired - New",
      "price": 55,
      "cost": 44.8,
      "soldPrice": 0,
      "description": "Step into the magical wilderness with the LEGO Forbidden Forest: Umbridge's Encounter (75967). This retired set features a buildable, posable giant Grawp and unique mythical creatures that allow fans to relive one of the series' most memorable confrontations.\n\nProduct Details:\n\nSet Number: 75967.\n\nPiece Count: 253 pieces.\n\nMinifigures: Includes 3 minifigures: Harry Potter, Hermione Granger, and Professor Dolores Umbridge.\n\nCreatures & Figures: Features 2 Centaurs (exclusive to this set at launch) and a large, posable Grawp giant figure.\n\nInteractive Features: The large tree opens up to reveal hidden accessories inside, including a lantern, a bone, a turkey leg, and even bicycle handlebars for Grawp.\n\nDimensions: Grawp stands over 5” (13cm) tall, and the tree measures over 4” (12cm) high when closed.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Harry Potter, Wizarding World, Forbidden Forest, Dolores Umbridge, Grawp, Centaur, Order of the Phoenix, LEGO 75967, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Harry Potter, Wizarding World, Forbidden Forest, Dolores Umbridge, Grawp, Centaur, Order of the Phoenix, LEGO 75967, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "have two, one I bought for $25",
      "status": "Active",
      "id": 1063,
      "photos": []
    },
    {
      "uuid": "c0013666-abbb-42a8-8551-10569cc1e6e6",
      "title": "LEGO Super Mario Luigi’s Mansion Haunt-and-Seek 71401 - Retired - New",
      "price": 160,
      "cost": 123.2,
      "soldPrice": 0,
      "description": "Create a gem-hunting, ghost-battling level with the LEGO Super Mario Luigi’s Mansion Haunt-and-Seek Expansion Set (71401). This 2022 retired set features iconic locations and characters from the beloved video game series, designed to be used with an interactive LEGO Mario or Luigi figure.\n\nProduct Details:\n\nSet Number: 71401.\n\nPiece Count: 877 pieces.\n\nFigures Included: Features 4 iconic characters: King Boo, a Terrier, a Grabber, and a Toad (trapped in a painting).\n\nInteractive Gameplay:\n\nBattle ghosts and explore a haunted mansion with a rotating hallway to access different rooms.\n\nFind hidden digital gems in the bedroom, dining room, and bathroom.\n\nRescue Toad from his painting and topple King Boo from his tower.\n\nModular Build: This set measures over 5.5\" (15cm) high, 17.5\" (44cm) wide, and 14\" (36cm) deep in its basic formation, but it is modular and can be rebuilt in many ways.\n\nCompatibility: Requires the LEGO Super Mario (71360) or LEGO Luigi (71387) Starter Course for the full interactive play experience.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Super Mario, Nintendo, Luigi’s Mansion, King Boo, Toad, Expansion Set, LEGO 71401, Ghost Hunting, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Super Mario, Nintendo, Luigi’s Mansion, King Boo, Toad, Expansion Set, LEGO 71401, Ghost Hunting, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1064,
      "photos": []
    },
    {
      "uuid": "42e652bf-8d0a-471e-9c26-9d2ba2b2eff9",
      "title": "LEGO BrickHeadz Voldemort, Nagini & Bellatrix 40496 - Retired - New",
      "price": 60,
      "cost": 39.2,
      "soldPrice": 0,
      "description": "Recreate the dark side of the Wizarding World with the LEGO BrickHeadz Voldemort, Nagini & Bellatrix (40496). This retired 2021 set features three buildable figures with authentic details from the Harry Potter films, perfect for display on their individual baseplates.\n\nProduct Details:\n\nSet Number: 40496.\n\nPiece Count: 344 pieces.\n\nCharacters Included: Features buildable figures of Lord Voldemort, his faithful serpent Nagini, and his most loyal follower, Bellatrix Lestrange.\n\nStylized Details:\n\nLord Voldemort is captured in his dark robes with his signature pale skin and no nose.\n\nBellatrix Lestrange features her wild, voluminous black hair and Death Eater attire.\n\nNagini is a unique, smaller brick-built snake figure.\n\nDimensions: Figures stand over 2\" (7cm) tall.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Harry Potter, BrickHeadz, Voldemort, Nagini, Bellatrix Lestrange, Wizarding World, LEGO 40496, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Harry Potter, BrickHeadz, Voldemort, Nagini, Bellatrix Lestrange, Wizarding World, LEGO 40496, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1065,
      "photos": []
    },
    {
      "uuid": "e060e228-7615-4149-8129-0b628e2980c6",
      "title": "LEGO Star Wars Hoth AT-ST 75322 - Retired Set - Brand New Sealed",
      "price": 100,
      "cost": 72.8,
      "soldPrice": 0,
      "description": "Recreate the iconic Battle of Hoth with the LEGO Hoth AT-ST (75322). This retired 2022 set features an authentically detailed walker with play-inspiring functions, perfect for fans of The Empire Strikes Back.\n\nProduct Details:\n\nSet Number: 75322.\n\nPiece Count: 586 pieces.\n\nMinifigures: Includes 3 minifigures: Chewbacca (with exclusive snow decoration), a Hoth AT-ST Pilot, and a Hoth Rebel Trooper, plus an Imperial Probe Droid figure.\n\nInteractive Features: The walker includes an opening hatch and roof for cockpit access, a wheel-operated rotating head, 2 spring-loaded shooters, and posable legs.\n\nDimensions: Measures over 10.5 in. (26 cm) high, 6 in. (16 cm) long, and 5 in. (13 cm) wide.\n\nRetired Status: This set was released in January 2022 and officially retired in December 2023.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Star Wars, Hoth AT-ST, Empire Strikes Back, Chewbacca, Walker, LEGO 75322, Battle of Hoth, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Star Wars, Hoth AT-ST, Empire Strikes Back, Chewbacca, Walker, LEGO 75322, Battle of Hoth, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1066,
      "photos": []
    },
    {
      "uuid": "85069a01-a972-409d-a019-fe0a73ffd31a",
      "title": "LEGO Star Wars Boba Fett’s Throne Room 75326 - Retired Set - Brand New",
      "price": 130,
      "cost": 80,
      "soldPrice": 0,
      "description": "Recreate authentic details from the Star Wars saga with Boba Fett’s Throne Room (75326). This retired 2022 set features a modular palace design that opens for easy access to a detailed throne room, kitchen, and barbecue area.\n\nProduct Details:\n\nSet Number: 75326.\n\nPiece Count: 732 pieces.\n\nMinifigures: Includes 7 characters: Boba Fett, Fennec Shand, Bib Fortuna, a Theelin Dancer, a Weequay Guard, a Gamorrean Guard, and a Quarren.\n\nInteractive Play Features:\n\nEject Function: Send Bib Fortuna flying from the throne with a built-in pop-up mechanism.\n\nHidden Treasure: Find a secret compartment inside the throne containing weapons and beskar bar elements.\n\nTilting Steps: Topple the Gamorrean Guard off the shaking palace steps.\n\nAccessory Elements: Includes a brick-built rotisserie in the kitchen and spotchka drink elements.\n\nDimensions: Measures over 6.5 in. (17 cm) high, 12.5 in. (32 cm) wide, and 8 in. (20 cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Star Wars, Boba Fett, Fennec Shand, Jabba's Palace, Book of Boba Fett, Mandalorian, LEGO 75326, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Star Wars, Boba Fett, Fennec Shand, Jabba's Palace, Book of Boba Fett, Mandalorian, LEGO 75326, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "Retail $130",
      "status": "Active",
      "id": 1067,
      "photos": []
    },
    {
      "uuid": "d7317b86-2b1e-481e-879c-3a53c57f7918",
      "title": "LEGO Batman vs. The Joker: Batmobile Chase 76180 - Retired - New Sealed",
      "price": 60,
      "cost": 30.4,
      "soldPrice": 0,
      "description": "Join forces with Batman and Batgirl to stop The Joker's bank heist in this action-packed LEGO DC Super Heroes (76180) set. This 2021 retired set is specifically designed for builders aged 4 and up, featuring \"Starter Brick\" elements for a fast and rewarding building experience.\n\nProduct Details:\n\nSet Number: 76180.\n\nPiece Count: 136 pieces.\n\nMinifigures: Includes 3 iconic figures: Batman (with cape), Batgirl (in Gray Rebirth suit), and The Joker (with green arms).\n\nVehicles: Features a buildable Batmobile (approx. 8\" long) and a wacky Hot Rod for The Joker.\n\nInteractive Play: Includes a bank vault that can be \"stolen\" by The Joker, plus Batman's Batarang, a grappling launcher, and Batgirl's skateboard.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Batman, DC Super Heroes, Batmobile, The Joker, Batgirl, LEGO 76180, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Batman, DC Super Heroes, Batmobile, The Joker, Batgirl, LEGO 76180, Building Set, Gift Idea, Kids Toys, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "Retail $40",
      "status": "Active",
      "id": 1068,
      "photos": []
    },
    {
      "uuid": "97dce3f4-5025-459c-a88b-0b56f8db14ac",
      "title": "LEGO Botanical Flowerpot 40588 - Retired Limited Edition - New Sealed",
      "price": 60,
      "cost": 0,
      "soldPrice": 0,
      "description": "Bring an elegant touch of nature to your home with the LEGO Flowerpot (40588). While officially a promotional set, it features the refined aesthetic of the popular Botanical Collection, making it a perfect addition to a shelf or desk alongside other brick-built plants.\n\nProduct Details:\n\nSet Number: 40588.\n\nPiece Count: 292 pieces.\n\nBotanical Highlights: Includes LEGO interpretations of springtime favorites like pussy willow, billy buttons (globosa craspedia), and cherry blossoms.\n\nClever Design: The yellow vase cleverly uses hot air balloon panel elements to create its rounded shape.\n\nDimensions: Once built, the model stands approximately 11 in. (29 cm) high and 4.5 in. (12 cm) wide.\n\nAvailability: This set was a limited-time exclusive in 2023 and is now officially retired.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, Flowerpot, Botanical Collection, LEGO 40588, Flowers, Home Decor, Gift with Purchase, Retired LEGO, Limited Edition, Building Set, Gift Idea, Adult LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, Flowerpot, Botanical Collection, LEGO 40588, Flowers, Home Decor, Gift with Purchase, Retired LEGO, Limited Edition, Building Set, Gift Idea, Adult LEGO",
      "location": "",
      "notes": "Retails $30",
      "status": "Active",
      "id": 1069,
      "photos": []
    },
    {
      "uuid": "392825a3-9d08-49b0-a16e-f8d7c5fff0e2",
      "title": "LEGO Icons Atari 2600 Video Computer System 10306 - Retired - New Sealed",
      "price": 380,
      "cost": 336,
      "soldPrice": 0,
      "description": "Take a trip back to the 1980s with this immersive LEGO Icons Atari 2600 (10306) building experience. This replica features the iconic wood-effect front panel and a variety of functional and hidden details that pay tribute to the pioneer of home video gaming.\n\nProduct Details:\n\nSet Number: 10306.\n\nPiece Count: 2,532 pieces.\n\nMinifigure: Includes 1 exclusive minifigure: a young gamer with a unique Atari logo torso.\n\n3 Classic Games: Build 3D vignettes and matching cartridges for Asteroids, Adventure, and Centipede.\n\nInteractive Features: * Functioning Switches: The front panel includes switches that mimic the feel of the original console.\n\nHidden Vignette: Slide the front panel forward to reveal a hidden 1980s bedroom scene complete with a retro TV, boom box, and posters.\n\nMovable Joystick: The brick-built joystick tilts and moves just like the original controller.\n\nDimensions: Once built, the main console measures over 3 in. (8 cm) high, 13 in. (33 cm) wide, and 8.5 in. (22 cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Icons, Atari 2600, Retro Gaming, 1980s, Video Game Console, LEGO 10306, Asteroids, Centipede, Adventure, Building Set, Gift Idea, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Icons, Atari 2600, Retro Gaming, 1980s, Video Game Console, LEGO 10306, Asteroids, Centipede, Adventure, Building Set, Gift Idea, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1070,
      "photos": []
    },
    {
      "uuid": "fa37501f-3b35-4a13-81ff-24f719ab20f4",
      "title": "LEGO Ideas Red London Telephone Box 21347 - Authentic Display - New Sealed",
      "price": 200,
      "cost": 168,
      "soldPrice": 0,
      "description": "Celebrate a quintessentially British landmark with the LEGO Ideas Red London Telephone Box (21347). This 2024 set, created through the LEGO Ideas fan program, captures the historical charm of the K2 kiosk on a quintessential London street corner.\n\nProduct Details:\n\nSet Number: 21347.\n\nPiece Count: 1,460 pieces.\n\nMinifigures: N/A (this is a standalone large-scale display model).\n\nKey Features:\n\nAuthentic Details: Features the classic red latticed windows, \"Telephone\" signs, and the black crown insignia.\n\nInteractive Elements: Includes a functioning light brick that illuminates the interior when you press down on the roof.\n\n2 Build Options: You can choose to equip the interior with either a traditional vintage rotary phone or a 1990s-style push-button phone.\n\nStreet Scene: The model sits on a buildable cobbled street with an old-style lamppost, hanging flower baskets, a flowerpot, and iron railings.\n\nDual Purpose: The expanded base with its fence and lamppost is specifically designed to double as a stylish stand for your mobile phone.\n\nDimensions: Measures over 12 in. (31 cm) high, 7.5 in. (19 cm) wide, and 6 in. (15 cm) deep.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, LEGO Ideas, Red London Telephone Box, United Kingdom, London, British Icon, K2 Telephone Box, 100th Anniversary, Display Model, Adult LEGO, Gift for Travelers, History Buff, Retired LEGO (Upcoming)\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, LEGO Ideas, Red London Telephone Box, United Kingdom, London, British Icon, K2 Telephone Box, 100th Anniversary, Display Model, Adult LEGO, Gift for Travelers, History Buff, Retired LEGO (Upcoming)",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1071,
      "photos": []
    },
    {
      "uuid": "eee3a616-daf1-4506-afaa-89b0e2e3ea72",
      "title": "LEGO BrickLink Mushroom House 910037 - Designer Program Series 2 - New Sealed",
      "price": 220,
      "cost": 134.4,
      "soldPrice": 0,
      "description": "Step into a magical world with the Mushroom House (910037), designed by fan-creator Jonas Kramm. Originally a popular project on LEGO Ideas that reached 10,000 supporters, this model was selected as a finalist for the BrickLink Designer Program Series 2. The set features a detailed mushroom residence for forest elves, complete with organic shapes and unique part usages.\n\nProduct Details:\n\nSet Number: 910037.\n\nPiece Count: 964 pieces.\n\nMinifigures: Includes 3 unique figures: two Forest Elves and a Fruit Merchant who arrives on a buildable snail mount.\n\nDetailed Interior:\n\nThe roof of the mushroom opens to reveal a two-story interior.\n\n1st Floor: Features a cozy kitchen with a fireplace and cauldron, plus a living room.\n\n2nd Floor: Accessible by climbing up leaves, containing a comfy bed and a desk for writing letters.\n\nPlayful Elements: Includes a fruit-filled wheelbarrow, a water pump for plants, and organic details like cherry-topped stems and large leaf stairs.\n\nDisplay Dimensions: Measures over 8.9\" (22.5 cm) high, 12.2\" (31 cm) long, and 6.6\" (16.7 cm) wide.\n\nCollector Status: Released in limited quantities in June 2024 and sold out rapidly; it is now officially retired.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, BrickLink Designer Program, Mushroom House, Forest Elves, Fantasy, Jonas Kramm, LEGO 910037, BDP Series 2, Building Set, Gift Idea, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, BrickLink Designer Program, Mushroom House, Forest Elves, Fantasy, Jonas Kramm, LEGO 910037, BDP Series 2, Building Set, Gift Idea, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1072,
      "photos": []
    },
    {
      "uuid": "cb56a189-d103-4b79-bc16-1df3e8477814",
      "title": "LEGO BrickLink Logging Railway 910035 - Series 2 Designer Program - New Sealed",
      "price": 375,
      "cost": 302.4,
      "soldPrice": 0,
      "description": "Inspired by the temporary logging railroads of central Oregon in the late 1800s, this set features a functional, highly detailed industrial scene. The model focuses on the fictional \"Planter & Children Logging Co.\" and its star locomotive, \"Toto,\" an 1890s-style 0-4-0 engine.\n\nProduct Details:\n\nSet Number: 910035.\n\nPiece Count: 2,731 pieces.\n\nMinifigures: Includes 3 unique minifigures: a Female Train Engineer, a Male Train Worker, and a Male Passenger.\n\nDetailed Train Cars:\n\n\"Toto\" Locomotive: Features a removable roof and space for figures.\n\nFlat Car: Carries a brick-built generator.\n\nLogging Wagon: Loaded with freshly cut logs bound by LEGO chains.\n\n\"Bobber\" Caboose: Features a removable roof, interior details, and a storage area for saplings to replant the forest.\n\nKey Features:\n\nMassive Wooden Trestle Bridge: A centerpiece display that is stable enough to be moved by hand once fully assembled.\n\nMotorization Ready: Designed with the option to add a motor and battery box (not included) for real track action.\n\nTrack Compatibility: Runs on standard LEGO tracks and uses standard buffers and magnets.\n\nAssembled Dimensions: Measures over 37 in. (94.1 cm) wide, 10.2 in. (25.8 cm) long, and 9.3 in. (23.7 cm) high.\n\nCollector Status: This was a limited production run of only 15,000 sets released in 2024 as part of the BrickLink Designer Program Series 2. It is now officially retired.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, BrickLink Designer Program, Logging Railway, Steam Train, Trestle Bridge, LEGO 910035, BDP Series 2, Train Collector, Building Set, Gift Idea, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, BrickLink Designer Program, Logging Railway, Steam Train, Trestle Bridge, LEGO 910035, BDP Series 2, Train Collector, Building Set, Gift Idea, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1073,
      "photos": []
    },
    {
      "uuid": "ccec4db6-8fb6-49c7-9a99-9b3c924d7853",
      "title": "LEGO 910015 Clockwork Aquarium - 874 Pieces - Mechanical Motion 4-in-1 Set - Sealed",
      "price": 200,
      "cost": 89.6,
      "soldPrice": 0,
      "description": "Designed by fan-creator Farquar, the Clockwork Aquarium (910015) was an exclusive limited-release from the 2021 BrickLink Designer Program. This unique model sits on an ornate cabinet and uses a sophisticated internal gear mechanism to simulate fish swimming and other realistic marine movements.\n\nProduct Details:\n\nSet Number: 910015.\n\nPiece Count: 874 pieces.\n\nMinifigure: Includes 1 unique minifigure: a Skeleton with a Pirate Hat and one arm.\n\nMechanical Action: Turning the crank at the side of the cabinet powers a belt that makes colorful fish swim in an oval, a crab jump up and down, and a surprise sea creature spin.\n\n4-in-1 Customization: The set includes components to build and swap between four distinct themes and backgrounds, though you can also mix and match parts to create your own custom underwater scene.\n\nIntricate Interior: The cabinet doors open to show stored \"fish food\" and \"chemical\" containers, and the entire tank/topper can be separated easily to access the internal gearbox.\n\nDimensions: Measures approximately 13.9 in. (35.4 cm) long, 7.4 in. (18.9 cm) wide, and 3.5 in. (8.8 cm) high.\n\nCollector Status: Released in 2022 through a limited-run crowdfunding competition where only the first few sets to hit 3,000 pledges were manufactured. It is now officially retired and highly sought after.\n\nCondition: Brand new in original factory-sealed packaging.\n\nPickup Details: Pickup at Guildford Mall. Other locations might be able to be arranged—please message to inquire!\n\nTags: LEGO, BrickLink Designer Program, Clockwork Aquarium, Mechanical LEGO, LEGO 910015, Fish Tank, Farquar, AFOL, Building Set, Gift Idea, Collectible LEGO, Retired LEGO\n\nPlease double-check the details; mistakes can happen, so verify all specs before purchase!",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "LEGO, BrickLink Designer Program, Clockwork Aquarium, Mechanical LEGO, LEGO 910015, Fish Tank, Farquar, AFOL, Building Set, Gift Idea, Collectible LEGO, Retired LEGO",
      "location": "",
      "notes": "",
      "status": "Active",
      "id": 1074,
      "photos": []
    },
    {
      "uuid": "cb79b0c6-b4a7-494a-a5fb-b64ce3bd6983",
      "title": "RARE RETIRED LEGO 40484 Santa's Front Yard Winter Seasonal GWP BNIB (Copy)",
      "price": 25,
      "cost": 0,
      "description": "LEGO 40484 Santa's Front Yard (BNIB)\n\nRARE / RETIRED / DISCONTINUED SEASONAL EXCLUSIVE SET\n\nThis was a limited edition Gift With Purchase (GWP) set released in November 2021 with a high spending threshold.\n\nThe set contains 317 pieces and includes a buildable reindeer figure and an elf minifigure.\n\nIt depicts a charming icy, moonlit setting in Santa's front yard with a snow-covered North Pole sign and trees.\n\nThe elf is shown feeding the reindeer a carrot by a clear stream.\n\nBrand New In Box (BNIB). Factory sealed, never opened.\n\nSearch Tags: 40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "brand": "Lego",
      "size": "",
      "category": "Toys",
      "condition": "new",
      "tags": "40484, Santa's Front Yard, Seasonal, Christmas, Winter Village, GWP, Exclusive, Retired, BNIB, LEGO",
      "location": "",
      "notes": "\nRETAIL $27 PAID ZERO FOR ALL",
      "status": "Sold",
      "id": 1075,
      "soldPrice": 25,
      "photos": []
    },
    {
      "uuid": "9ea43a21-4731-4735-aa75-f7068a69489a",
      "dateCreated": "2025-12-24T01:57:47.936Z",
      "dateSold": null,
      "title": "LEGO® Icons #10300 Back to the Future Time Machine",
      "quantity": 1,
      "cost": 280,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "INCLUDES TAX, RETAIL $250",
      "status": "Inventory",
      "id": 1076,
      "photos": []
    },
    {
      "uuid": "966de9bf-12a2-4bd4-816f-1467d71ea1c2",
      "dateCreated": "2025-12-24T02:00:23.309Z",
      "dateSold": null,
      "title": "Ideas #21334 Jazz Quartet",
      "quantity": 1,
      "cost": 145.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $130 BEFORE TAX",
      "status": "Inventory",
      "id": 1077,
      "photos": []
    },
    {
      "uuid": "a24e9c0e-8ece-4034-b25a-fc8a2e72f776",
      "dateCreated": "2025-12-24T02:03:01.261Z",
      "dateSold": null,
      "title": "The Botanical Collection #10329 Tiny Plants",
      "quantity": 1,
      "cost": 78.4,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $70",
      "status": "Inventory",
      "id": 1078,
      "photos": []
    },
    {
      "uuid": "8d4d3fd9-4114-4b1f-b071-167b619ba166",
      "dateCreated": "2025-12-24T02:04:16.397Z",
      "dateSold": null,
      "title": "Ideas #21345 Polaroid OneStep SX-70 Camera",
      "quantity": 1,
      "cost": 112,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $100",
      "status": "Inventory",
      "id": 1079,
      "photos": []
    },
    {
      "uuid": "8cbe9b0a-cd79-4e84-81c9-497865b5d7d7",
      "dateCreated": "2025-12-24T02:06:26.428Z",
      "dateSold": null,
      "title": "Marvel #76249 Venomized Groot",
      "quantity": 1,
      "cost": 72.8,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $65",
      "status": "Inventory",
      "id": 1080,
      "photos": []
    },
    {
      "uuid": "08e17af4-d1d9-430e-b147-6b4df99a1fb4",
      "dateCreated": "2025-12-24T02:09:05.048Z",
      "dateSold": null,
      "title": "Fantasy Adventure Ride #6435198",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "Fantasy Adventure Ride {International Yellow Box Release}\nItem No: 5007489-1  Alternate Item No: 6435196, 6435198",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $30",
      "status": "Inventory",
      "id": 1081,
      "photos": []
    },
    {
      "uuid": "2dfa307d-7053-4120-9e71-326cb3dab392",
      "dateCreated": "2025-12-24T02:11:10.293Z",
      "dateSold": null,
      "title": "LEGO #40529 CHILDRENS AMUSEMENT PARK",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $19",
      "status": "Inventory",
      "id": 1082,
      "photos": []
    },
    {
      "uuid": "1a62a16a-6678-4386-af0b-f251da9660e3",
      "dateCreated": "2025-12-24T02:12:14.471Z",
      "dateSold": null,
      "title": "LEGO #40522 Valentine Lovebirds",
      "quantity": 1,
      "cost": 19.04,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $17",
      "status": "Inventory",
      "id": 1083,
      "photos": []
    },
    {
      "uuid": "9705c767-5bce-463c-93a9-c7a33861ea9c",
      "dateCreated": "2025-12-24T02:13:32.757Z",
      "dateSold": null,
      "title": "LEGO BrickHeadz #40443 Budgie",
      "quantity": 1,
      "cost": 13.44,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $20",
      "status": "Inventory",
      "id": 1084,
      "photos": []
    },
    {
      "uuid": "9ed5c0c3-7847-431d-919b-7e0911c1dc26",
      "dateCreated": "2025-12-24T02:14:52.101Z",
      "dateSold": null,
      "title": "LEGO #40704 MICRO NINJAGO DOCKS",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN ONE",
      "notes": "RETAIL $19",
      "status": "Inventory",
      "id": 1085,
      "photos": []
    },
    {
      "uuid": "08f9b3fb-064d-4239-a9f0-c704f7117f2d",
      "dateCreated": "2025-12-24T02:18:06.493Z",
      "dateSold": null,
      "title": "LEGO #40580 BLACKTRON CRUISER",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $40",
      "status": "Inventory",
      "id": 1086,
      "photos": []
    },
    {
      "uuid": "a618220c-75c4-4159-af5d-78c8b5ea92a0",
      "dateCreated": "2025-12-24T02:19:24.164Z",
      "dateSold": null,
      "title": "LEGO #40588 FLOWERPOT GWP",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $30",
      "status": "Inventory",
      "id": 1087,
      "photos": []
    },
    {
      "uuid": "2bd68db5-260b-4ba9-a1bb-0d5a6dd988fc",
      "dateCreated": "2025-12-24T02:21:19.058Z",
      "dateSold": null,
      "title": "LEGO #40564 WINTER ELVES SCENE",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $25",
      "status": "Inventory",
      "id": 1088,
      "photos": []
    },
    {
      "uuid": "814310a4-4189-4008-bdaf-7ace3d0ea629",
      "dateCreated": "2025-12-24T02:23:21.292Z",
      "dateSold": null,
      "title": "LEGO #40563 TRIBUTE TO LEGO HOUSE",
      "quantity": 2,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO, BIN THREE",
      "notes": "RETAIL $40",
      "status": "Inventory",
      "id": 1089,
      "photos": []
    },
    {
      "uuid": "9317a696-d011-409a-9af0-8827e09d8afd",
      "dateCreated": "2025-12-24T02:26:55.186Z",
      "dateSold": null,
      "title": "LEGO #71404 SUPER MARIO GOOMBAS SHOE EXPANSION SET",
      "quantity": 1,
      "cost": 15.68,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $14\nORD#T414251210",
      "status": "Inventory",
      "id": 1090,
      "photos": []
    },
    {
      "uuid": "6c18f5fd-5f7f-4595-a268-a2c38bdedaf1",
      "dateCreated": "2025-12-24T02:30:18.817Z",
      "dateSold": null,
      "title": "LEGO #6487473 GRAY CASTLE",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "Gray Castle\nItem No: 5008074-1  Alternate Item No: 6487473, 6487474\nRETAIL $34\nORD# T425172805",
      "status": "Inventory",
      "id": 1091,
      "photos": []
    },
    {
      "uuid": "17142697-22df-4753-8810-af17592a13f6",
      "dateCreated": "2025-12-24T02:32:33.557Z",
      "dateSold": null,
      "title": "LEGO #10497 GALAXY EXPLORER",
      "quantity": 1,
      "cost": 146.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $130\nORD#T401049886",
      "status": "Inventory",
      "id": 1092,
      "photos": []
    },
    {
      "uuid": "38062ffd-8ff2-44a1-a2bb-9ec3f7a75103",
      "dateCreated": "2025-12-24T02:34:38.871Z",
      "dateSold": null,
      "title": "LEGO #71426 PIRANHA PLANT SUPER MARIO",
      "quantity": 1,
      "cost": 89.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $80\nORD# T425177039",
      "status": "Inventory",
      "id": 1093,
      "photos": []
    },
    {
      "uuid": "2920bb4a-8bbb-4e7d-ad78-f8f3ea0786fd",
      "dateCreated": "2025-12-24T02:36:47.851Z",
      "dateSold": null,
      "title": "LEGO #76223 NNO GAUNTLET MARVEL",
      "quantity": 1,
      "cost": 100.8,
      "price": null,
      "soldPrice": null,
      "description": "RETIRED",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $90\nORD #T393689133",
      "status": "Inventory",
      "id": 1094,
      "photos": []
    },
    {
      "uuid": "3c096bbc-b8ed-4b0f-91f8-4777515192a1",
      "dateCreated": "2025-12-24T02:38:32.268Z",
      "dateSold": null,
      "title": "LEGO #910015 CLOCKWORK AQUARIUM BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 89.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $80\nORD#T381224943",
      "status": "Inventory",
      "id": 1095,
      "photos": []
    },
    {
      "uuid": "d251cb3e-c2a4-4aa9-9e8d-c1c270db2caf",
      "dateCreated": "2025-12-24T02:40:15.276Z",
      "dateSold": null,
      "title": "LEGO #75349 CAPTAIN REX HELMET STAR WARS",
      "quantity": 1,
      "cost": 100.8,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $90\nORD# T412225523",
      "status": "Inventory",
      "id": 1096,
      "photos": []
    },
    {
      "uuid": "a4dce031-0c78-40ad-8d4b-b0d7f9f1de24",
      "dateCreated": "2025-12-24T02:42:14.844Z",
      "dateSold": null,
      "title": "LEGO #76251 STAR-LORDS HELMET MARVEL",
      "quantity": 1,
      "cost": 112,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $100\nORD #T409304283",
      "status": "Inventory",
      "id": 1097,
      "photos": []
    },
    {
      "uuid": "55c33aa3-cfa1-406b-a235-85d3ee16d961",
      "dateCreated": "2025-12-24T02:43:39.056Z",
      "dateSold": null,
      "title": "LEGO #40627 SONIC THE HEDGEHOG BRICKHEADS",
      "quantity": 1,
      "cost": 14.69,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $13\nORD # T433731315",
      "status": "Inventory",
      "id": 1098,
      "photos": []
    },
    {
      "uuid": "179cd554-9a23-45ce-8a95-a56feebff5be",
      "dateCreated": "2025-12-24T02:45:09.741Z",
      "dateSold": null,
      "title": "LEGO #40628 MILES \"TAILS\" PROWLER BRICKHEADS",
      "quantity": 1,
      "cost": 14.69,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $13\nORD #T433731315",
      "status": "Inventory",
      "id": 1099,
      "photos": []
    },
    {
      "uuid": "f4239234-fa72-41a5-aedd-f409a05f545d",
      "dateCreated": "2025-12-24T02:47:08.430Z",
      "dateSold": null,
      "title": "LEGO #40590 HOUSE OF THE WORLD 2 GWP",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $25\nORD #T414251210",
      "status": "Inventory",
      "id": 1100,
      "photos": []
    },
    {
      "uuid": "d3b264b8-3772-40b9-b064-a71ee6117338",
      "dateCreated": "2025-12-24T02:49:06.707Z",
      "dateSold": null,
      "title": "LEGO #6471612 Tape Player / Cassette Player",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "Item No: 5007869-1  Alternate Item No: 6471611, 6471612\nRETAIL $34\nORD #T425177039",
      "status": "Inventory",
      "id": 1101,
      "photos": []
    },
    {
      "uuid": "aa046e8f-da84-4f2a-b625-c3edbeacbbb5",
      "dateCreated": "2025-12-24T02:50:37.497Z",
      "dateSold": null,
      "title": "LEGO #40595 TRIBUTE TO GALILEO GALILEI",
      "quantity": 1,
      "cost": 0,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $30\nORD #T423638370",
      "status": "Inventory",
      "id": 1102,
      "photos": []
    },
    {
      "uuid": "a8835986-6fa8-4952-bc08-003dce4a5446",
      "dateCreated": "2025-12-24T02:52:23.092Z",
      "dateSold": null,
      "title": "LEGO #76217 I AM GROOT MARVEL",
      "quantity": 1,
      "cost": 78.4,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN TWO",
      "notes": "RETAIL $70\nORD #T392377341",
      "status": "Inventory",
      "id": 1103,
      "photos": []
    },
    {
      "uuid": "79be86bf-1604-4cef-8d32-dbf561dfa6ef",
      "dateCreated": "2025-12-24T02:55:29.966Z",
      "dateSold": null,
      "title": "LEGO #910039 The Art of Chocolate BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 336,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX A",
      "notes": "RETAIL $300\nORD# T445921627",
      "status": "Inventory",
      "id": 1104,
      "photos": []
    },
    {
      "uuid": "54f05250-86e3-4184-b585-3ee168cc1d60",
      "dateCreated": "2025-12-24T02:57:07.640Z",
      "dateSold": null,
      "title": "LEGO #910046 Merchant Boat BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 246.4,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX A",
      "notes": "RETAIL $220\nORD #T459386114",
      "status": "Inventory",
      "id": 1105,
      "photos": []
    },
    {
      "uuid": "bb0dd4d8-a777-4b1c-9255-1590cda656f4",
      "dateCreated": "2025-12-24T02:59:11.498Z",
      "dateSold": null,
      "title": "LEGO #910045 Siege Encampment BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 336,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX A",
      "notes": "RETAIL $300\nORD #T459386114",
      "status": "Inventory",
      "id": 1106,
      "photos": []
    },
    {
      "uuid": "bcd48e24-be17-476f-b94b-cf720cf6c532",
      "dateCreated": "2025-12-24T03:01:46.348Z",
      "dateSold": null,
      "title": "LEGO #910033 Old Train Engine Shed BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 336,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX A",
      "notes": "RETAIL $300\nORD #T432500135",
      "status": "Inventory",
      "id": 1107,
      "photos": []
    },
    {
      "uuid": "e2e7ad90-c77b-4d75-9a8a-4103e58d87fc",
      "dateCreated": "2025-12-24T03:03:06.832Z",
      "dateSold": null,
      "title": "LEGO #910035 Logging Railway",
      "quantity": 1,
      "cost": 302.4,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX A",
      "notes": "RETAIL $270\nORD #T438808667\n",
      "status": "Inventory",
      "id": 1108,
      "photos": []
    },
    {
      "uuid": "32f6ccd7-2f3f-4e6a-a416-20300321026a",
      "dateCreated": "2025-12-24T03:04:33.707Z",
      "dateSold": null,
      "title": "LEGO® Icons #10312 Jazz Club",
      "quantity": 1,
      "cost": 336,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX B",
      "notes": "RETAIL $300\nORD #T409304350",
      "status": "Inventory",
      "id": 1109,
      "photos": []
    },
    {
      "uuid": "08820c77-35bc-4e35-82f9-ee7c5068ebbb",
      "dateCreated": "2025-12-24T03:05:50.691Z",
      "dateSold": null,
      "title": "LEGO® Super Mario™ #71411 The Mighty Bowser™",
      "quantity": 1,
      "cost": 392,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX B",
      "notes": "RETAIL $350\nORD #T401052972",
      "status": "Inventory",
      "id": 1110,
      "photos": []
    },
    {
      "uuid": "734723fd-af68-4844-b17c-34e5931b39a1",
      "dateCreated": "2025-12-24T03:07:31.032Z",
      "dateSold": null,
      "title": "LEGO Ideas #21337 Table Football",
      "quantity": 1,
      "cost": 208.32,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX B",
      "notes": "RETIRED\nRETAIL $310\nORD #T423638370",
      "status": "Inventory",
      "id": 1111,
      "photos": []
    },
    {
      "uuid": "35f9c4ad-758d-4932-b5d5-5b01b36b7c18",
      "dateCreated": "2025-12-24T03:10:27.368Z",
      "dateSold": null,
      "title": "LEGO #910031 General Store BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 235.2,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX C",
      "notes": "RETAIL $210\nORD #T432414371",
      "status": "Inventory",
      "id": 1112,
      "photos": []
    },
    {
      "uuid": "564f28a0-95b8-43d2-9236-0f8ae6e3765c",
      "dateCreated": "2025-12-24T03:13:53.220Z",
      "dateSold": null,
      "title": "LEGO #910013 Retro Bowling Alley BRICKLINK DESIGNER",
      "quantity": 1,
      "cost": 336,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX C",
      "notes": "RETAIL $300\nORD #T381224943",
      "status": "Inventory",
      "id": 1113,
      "photos": []
    },
    {
      "uuid": "4ab7f175-b89b-49a7-bf0a-a0e2824c94e3",
      "dateCreated": "2025-12-24T03:15:26.395Z",
      "dateSold": null,
      "title": "LEGO #80109 LUNAR NEW YEAR ICE FESTIVAL",
      "quantity": 1,
      "cost": 117.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX C",
      "notes": "RETAIL $150\nORD# T401056434",
      "status": "Inventory",
      "id": 1114,
      "photos": []
    },
    {
      "uuid": "7ffccd64-692a-4cd0-84ef-0e1f64e9361e",
      "dateCreated": "2025-12-24T03:16:47.314Z",
      "dateSold": null,
      "title": "LEGO #21338 A-FRAME CABIN",
      "quantity": 1,
      "cost": 268.8,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX C",
      "notes": "RETIRED\nRETAIL $240\nORD #T409304211",
      "status": "Inventory",
      "id": 1115,
      "photos": []
    },
    {
      "uuid": "0358279f-9a47-4dc1-834f-21ef947850a4",
      "dateCreated": "2025-12-24T03:18:22.184Z",
      "dateSold": null,
      "title": "LEGO #31208 HOKUSAI - THE GREAT WAVE ",
      "quantity": 1,
      "cost": 156.8,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BOX C",
      "notes": "RETAIL $140\nORD #T411606958",
      "status": "Inventory",
      "id": 1116,
      "photos": []
    },
    {
      "uuid": "758d1a9f-aaab-451f-8438-ca0228434aa2",
      "dateCreated": "2025-12-24T03:24:14.353Z",
      "dateSold": null,
      "title": "LEGO Star Wars™ #75352 Emperor's Throne Room™ Diorama",
      "quantity": 1,
      "cost": 145.6,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN THREE",
      "notes": "RETAIL $130\nORD #T413018835",
      "status": "Inventory",
      "id": 1117,
      "photos": []
    },
    {
      "uuid": "4e7455a2-b385-4454-89e0-808d36fd76f2",
      "dateCreated": "2025-12-24T03:26:02.453Z",
      "dateSold": null,
      "title": "LEGO Harry Potter™ #76399 Hogwarts™ Magical Trunk",
      "quantity": 1,
      "cost": 95.2,
      "price": null,
      "soldPrice": null,
      "description": "",
      "brand": "LEGO",
      "size": "",
      "category": "TOYS",
      "condition": "new",
      "tags": "",
      "location": "BIN THREE",
      "notes": "RETIRED\nRETAIL $85\nORD #T414251210",
      "status": "Inventory",
      "id": 1118,
      "photos": []
    }
  ]
}